podonoghue/usbdm-firmware/BootLoopMKEx/Project_Headers/MKE02Z16M2.h
/****************************************************************************************************//**
 * @file     MKE02Z2.h
 *
 * @brief    CMSIS Cortex-M Peripheral Access Layer Header File for MKE02Z2.
 *           Equivalent: 
 *
 * @version  V1.6
 * @date     2017/06
 *
 *******************************************************************************************************/

#ifndef MCU_MKE02Z2
#define MCU_MKE02Z2

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/**
* @addtogroup Interrupt_vector_numbers_GROUP Interrupt vector numbers
* @brief Vector numbers required for NVIC functions
* @{
*/
/* -------------------------  Interrupt Number Definition  ------------------------ */

/**
 * Interrupt vector numbers
 */
typedef enum {
/* ------------------------  Processor Exceptions Numbers  ------------------------- */
  Reset_IRQn                    = -15,   /**<   1 Reset Vector, invoked on Power up and warm reset                                 */
  NonMaskableInt_IRQn           = -14,   /**<   2 Non maskable Interrupt, cannot be stopped or preempted                           */
  HardFault_IRQn                = -13,   /**<   3 Hard Fault, all classes of Fault                                                 */
  SVCall_IRQn                   =  -5,   /**<  11 System Service Call via SVC instruction                                          */
  PendSV_IRQn                   =  -2,   /**<  14 Pendable request for system service                                              */
  SysTick_IRQn                  =  -1,   /**<  15 System Tick Timer                                                                */
/* ----------------------   MKE02Z2 VectorTable                      ---------------------- */
  FTMRH_IRQn                    =   5,   /**<  21 Flash Memory                                                                     */
  PMC_IRQn                      =   6,   /**<  22 Power Management Controller                                                      */
  IRQ_IRQn                      =   7,   /**<  23 External Interrupt                                                               */
  I2C0_IRQn                     =   8,   /**<  24 Inter-Integrated Circuit                                                         */
  SPI0_IRQn                     =  10,   /**<  26 Serial Peripheral Interface                                                      */
  SPI1_IRQn                     =  11,   /**<  27 Serial Peripheral Interface                                                      */
  UART0_IRQn                    =  12,   /**<  28 Serial Communication Interface                                                   */
  UART1_IRQn                    =  13,   /**<  29 Serial Communication Interface                                                   */
  UART2_IRQn                    =  14,   /**<  30 Serial Communication Interface                                                   */
  ADC0_IRQn                     =  15,   /**<  31 Analogue to Digital Converter                                                    */
  ACMP0_IRQn                    =  16,   /**<  32 Analogue comparator                                                              */
  FTM0_IRQn                     =  17,   /**<  33 FlexTimer Module                                                                 */
  FTM1_IRQn                     =  18,   /**<  34 FlexTimer Module                                                                 */
  FTM2_IRQn                     =  19,   /**<  35 FlexTimer Module                                                                 */
  RTC_Alarm_IRQn                =  20,   /**<  36 Real Time Clock                                                                  */
  ACMP1_IRQn                    =  21,   /**<  37 Analogue comparator                                                              */
  PIT0_IRQn                     =  22,   /**<  38 Periodic Interrupt Timer                                                         */
  PIT1_IRQn                     =  23,   /**<  39 Periodic Interrupt Timer                                                         */
  KBI0_IRQn                     =  24,   /**<  40 Keyboard Interrupt                                                               */
  KBI1_IRQn                     =  25,   /**<  41 Keyboard Interrupt                                                               */
  ICS_IRQn                      =  27,   /**<  43 Clock Management                                                                 */
  WDOG_IRQn                     =  28,   /**<  44 Watchdog Timer                                                                   */
} IRQn_Type;

/**
 * @} */ /* End group Interrupt_vector_numbers_GROUP 
 */
/**
* @addtogroup Interrupt_handler_prototypes_GROUP Interrupt handler prototypes
* @brief Prototypes for interrupt handlers
* @{
*/
/* -------------------------  Exception Handlers  ------------------------ */
extern void NMI_Handler(void);                 /**< Non maskable Interrupt, cannot be stopped or preempted                           */
extern void HardFault_Handler(void);           /**< Hard Fault, all classes of Fault                                                 */
extern void SVC_Handler(void);                 /**< System Service Call via SVC instruction                                          */
extern void PendSV_Handler(void);              /**< Pendable request for system service                                              */
extern void SysTick_Handler(void);             /**< System Tick Timer                                                                */
extern void FTMRH_IRQHandler(void);            /**< Flash Memory                                                                     */
extern void PMC_IRQHandler(void);              /**< Power Management Controller                                                      */
extern void IRQ_IRQHandler(void);              /**< External Interrupt                                                               */
extern void I2C0_IRQHandler(void);             /**< Inter-Integrated Circuit                                                         */
extern void SPI0_IRQHandler(void);             /**< Serial Peripheral Interface                                                      */
extern void SPI1_IRQHandler(void);             /**< Serial Peripheral Interface                                                      */
extern void UART0_IRQHandler(void);            /**< Serial Communication Interface                                                   */
extern void UART1_IRQHandler(void);            /**< Serial Communication Interface                                                   */
extern void UART2_IRQHandler(void);            /**< Serial Communication Interface                                                   */
extern void ADC0_IRQHandler(void);             /**< Analogue to Digital Converter                                                    */
extern void ACMP0_IRQHandler(void);            /**< Analogue comparator                                                              */
extern void FTM0_IRQHandler(void);             /**< FlexTimer Module                                                                 */
extern void FTM1_IRQHandler(void);             /**< FlexTimer Module                                                                 */
extern void FTM2_IRQHandler(void);             /**< FlexTimer Module                                                                 */
extern void RTC_Alarm_IRQHandler(void);        /**< Real Time Clock                                                                  */
extern void ACMP1_IRQHandler(void);            /**< Analogue comparator                                                              */
extern void PIT0_IRQHandler(void);             /**< Periodic Interrupt Timer                                                         */
extern void PIT1_IRQHandler(void);             /**< Periodic Interrupt Timer                                                         */
extern void KBI0_IRQHandler(void);             /**< Keyboard Interrupt                                                               */
extern void KBI1_IRQHandler(void);             /**< Keyboard Interrupt                                                               */
extern void ICS_IRQHandler(void);              /**< Clock Management                                                                 */
extern void WDOG_IRQHandler(void);             /**< Watchdog Timer                                                                   */

/**
 * @} */ /* End group Interrupt_handler_prototypes_GROUP 
 */
/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/**
* @addtogroup Cortex_Core_Configuration_GROUP Cortex Core Configuration
* @brief Configuration of the cm4 Processor and Core Peripherals
* @{
*/
#define __CM0PLUS_REV             0x0100     /**< CPU Revision                                        */
#define __MPU_PRESENT             0          /**< Whether MPU is present                              */
#define __NVIC_PRIO_BITS          2          /**< Number of implemented bits in NVIC PRIO register    */
#define __Vendor_SysTickConfig    0          /**< Whether Vendor implemented SYSTICK timer is present */
#define __FPU_PRESENT             0          /**< Whether FPU is present                              */
#define __VTOR_PRESENT            1          /**< Whether VTOR register is present                    */

/**
 * @} */ /* End group Cortex_Core_Configuration_GROUP 
 */
#include "core_cm0plus.h"       /* Processor and core peripherals     */
#include "system.h"             /* Device specific configuration file */

#ifndef __IO
#define __IO volatile 
#endif

#ifndef __I
#define __I volatile const
#endif

