podonoghue/usbdm-firmware/BootLoopMKEx/Project_Headers/MKE02Z16M2.h
#ifndef __O
#define __O volatile
#endif


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */



/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif
/**
* @addtogroup Peripheral_access_layer_GROUP Device Peripheral Access Layer
* @brief C structs allowing access to peripheral registers
* @{
*/
/**
* @addtogroup ACMP_Peripheral_access_layer_GROUP ACMP Peripheral Access Layer
* @brief C Struct for ACMP
* @{
*/

/* ================================================================================ */
/* ================           ACMP0 (file:ACMP0_MKE)               ================ */
/* ================================================================================ */

/**
 * @brief Analog comparator
 */
/**
* @addtogroup ACMP_structs_GROUP ACMP struct
* @brief Struct for ACMP
* @{
*/
typedef struct {                                /*       ACMP0 Structure                                              */
   __IO uint8_t   CS;                           /**< 0000: ACMP Control and Status Register                             */
   __IO uint8_t   C0;                           /**< 0001: ACMP Control Register 0                                      */
   __IO uint8_t   C1;                           /**< 0002: ACMP Control Register 1                                      */
   __IO uint8_t   C2;                           /**< 0003: ACMP Control Register 2                                      */
} ACMP_Type;

/**
 * @} */ /* End group ACMP_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'ACMP0' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup ACMP_Register_Masks_GROUP ACMP Register Masks
* @brief Register Masks for ACMP
* @{
*/
/* ------- CS Bit Fields                            ------ */
#define ACMP_CS_ACMOD_MASK                       (0x3U)                                              /*!< ACMP0_CS.ACMOD Mask                     */
#define ACMP_CS_ACMOD_SHIFT                      (0U)                                                /*!< ACMP0_CS.ACMOD Position                 */
#define ACMP_CS_ACMOD(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x3UL)             /*!< ACMP0_CS.ACMOD Field                    */
#define ACMP_CS_ACOPE_MASK                       (0x4U)                                              /*!< ACMP0_CS.ACOPE Mask                     */
#define ACMP_CS_ACOPE_SHIFT                      (2U)                                                /*!< ACMP0_CS.ACOPE Position                 */
#define ACMP_CS_ACOPE(x)                         (((uint8_t)(((uint8_t)(x))<<2U))&0x4UL)             /*!< ACMP0_CS.ACOPE Field                    */
#define ACMP_CS_ACO_MASK                         (0x8U)                                              /*!< ACMP0_CS.ACO Mask                       */
#define ACMP_CS_ACO_SHIFT                        (3U)                                                /*!< ACMP0_CS.ACO Position                   */
#define ACMP_CS_ACO(x)                           (((uint8_t)(((uint8_t)(x))<<3U))&0x8UL)             /*!< ACMP0_CS.ACO Field                      */
#define ACMP_CS_ACIE_MASK                        (0x10U)                                             /*!< ACMP0_CS.ACIE Mask                      */
#define ACMP_CS_ACIE_SHIFT                       (4U)                                                /*!< ACMP0_CS.ACIE Position                  */
#define ACMP_CS_ACIE(x)                          (((uint8_t)(((uint8_t)(x))<<4U))&0x10UL)            /*!< ACMP0_CS.ACIE Field                     */
#define ACMP_CS_ACF_MASK                         (0x20U)                                             /*!< ACMP0_CS.ACF Mask                       */
#define ACMP_CS_ACF_SHIFT                        (5U)                                                /*!< ACMP0_CS.ACF Position                   */
#define ACMP_CS_ACF(x)                           (((uint8_t)(((uint8_t)(x))<<5U))&0x20UL)            /*!< ACMP0_CS.ACF Field                      */
#define ACMP_CS_HYST_MASK                        (0x40U)                                             /*!< ACMP0_CS.HYST Mask                      */
#define ACMP_CS_HYST_SHIFT                       (6U)                                                /*!< ACMP0_CS.HYST Position                  */
#define ACMP_CS_HYST(x)                          (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< ACMP0_CS.HYST Field                     */
#define ACMP_CS_ACE_MASK                         (0x80U)                                             /*!< ACMP0_CS.ACE Mask                       */
#define ACMP_CS_ACE_SHIFT                        (7U)                                                /*!< ACMP0_CS.ACE Position                   */
#define ACMP_CS_ACE(x)                           (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< ACMP0_CS.ACE Field                      */
/* ------- C0 Bit Fields                            ------ */
#define ACMP_C0_ACNSEL_MASK                      (0x3U)                                              /*!< ACMP0_C0.ACNSEL Mask                    */
#define ACMP_C0_ACNSEL_SHIFT                     (0U)                                                /*!< ACMP0_C0.ACNSEL Position                */
#define ACMP_C0_ACNSEL(x)                        (((uint8_t)(((uint8_t)(x))<<0U))&0x3UL)             /*!< ACMP0_C0.ACNSEL Field                   */
#define ACMP_C0_ACPSEL_MASK                      (0x30U)                                             /*!< ACMP0_C0.ACPSEL Mask                    */
#define ACMP_C0_ACPSEL_SHIFT                     (4U)                                                /*!< ACMP0_C0.ACPSEL Position                */
#define ACMP_C0_ACPSEL(x)                        (((uint8_t)(((uint8_t)(x))<<4U))&0x30UL)            /*!< ACMP0_C0.ACPSEL Field                   */
/* ------- C1 Bit Fields                            ------ */
#define ACMP_C1_DACVAL_MASK                      (0x3FU)                                             /*!< ACMP0_C1.DACVAL Mask                    */
#define ACMP_C1_DACVAL_SHIFT                     (0U)                                                /*!< ACMP0_C1.DACVAL Position                */
#define ACMP_C1_DACVAL(x)                        (((uint8_t)(((uint8_t)(x))<<0U))&0x3FUL)            /*!< ACMP0_C1.DACVAL Field                   */
#define ACMP_C1_DACREF_MASK                      (0x40U)                                             /*!< ACMP0_C1.DACREF Mask                    */
#define ACMP_C1_DACREF_SHIFT                     (6U)                                                /*!< ACMP0_C1.DACREF Position                */
#define ACMP_C1_DACREF(x)                        (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< ACMP0_C1.DACREF Field                   */
#define ACMP_C1_DACEN_MASK                       (0x80U)                                             /*!< ACMP0_C1.DACEN Mask                     */
#define ACMP_C1_DACEN_SHIFT                      (7U)                                                /*!< ACMP0_C1.DACEN Position                 */
#define ACMP_C1_DACEN(x)                         (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< ACMP0_C1.DACEN Field                    */
/* ------- C2 Bit Fields                            ------ */
#define ACMP_C2_ACIPE_MASK                       (0x7U)                                              /*!< ACMP0_C2.ACIPE Mask                     */
#define ACMP_C2_ACIPE_SHIFT                      (0U)                                                /*!< ACMP0_C2.ACIPE Position                 */
#define ACMP_C2_ACIPE(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x7UL)             /*!< ACMP0_C2.ACIPE Field                    */
/**
 * @} */ /* End group ACMP_Register_Masks_GROUP 
 */

