podonoghue/usbdm-firmware/BootLoopMKEx/Project_Headers/MKE02Z16M2.h
/* ACMP0 - Peripheral instance base addresses */
#define ACMP0_BasePtr                  0x40073000UL //!< Peripheral base address
#define ACMP0                          ((ACMP_Type *) ACMP0_BasePtr) //!< Freescale base pointer
#define ACMP0_BASE_PTR                 (ACMP0) //!< Freescale style base pointer
/**
 * @} */ /* End group ACMP_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup ACMP_Peripheral_access_layer_GROUP ACMP Peripheral Access Layer
* @brief C Struct for ACMP
* @{
*/

/* ================================================================================ */
/* ================           ACMP1 (derived from ACMP0)           ================ */
/* ================================================================================ */

/**
 * @brief Analog comparator
 */

/* ACMP1 - Peripheral instance base addresses */
#define ACMP1_BasePtr                  0x40074000UL //!< Peripheral base address
#define ACMP1                          ((ACMP_Type *) ACMP1_BasePtr) //!< Freescale base pointer
#define ACMP1_BASE_PTR                 (ACMP1) //!< Freescale style base pointer
/**
 * @} */ /* End group ACMP_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup ADC_Peripheral_access_layer_GROUP ADC Peripheral Access Layer
* @brief C Struct for ADC
* @{
*/

/* ================================================================================ */
/* ================           ADC0 (file:ADC0_MKE02)               ================ */
/* ================================================================================ */

/**
 * @brief Analog-to-Digital Converter
 */
/**
* @addtogroup ADC_structs_GROUP ADC struct
* @brief Struct for ADC
* @{
*/
typedef struct {                                /*       ADC0 Structure                                               */
   __IO uint32_t  SC1;                          /**< 0000: Status and Control Register 1                                */
   __IO uint32_t  SC2;                          /**< 0004: Status and Control Register 2                                */
   __IO uint32_t  SC3;                          /**< 0008: Status and Control Register 3                                */
   __IO uint32_t  SC4;                          /**< 000C: Status and Control Register 4                                */
   __I  uint32_t  R;                            /**< 0010: Conversion Result Register                                   */
   __IO uint32_t  CV;                           /**< 0014: Compare Value Register                                       */
   __IO uint32_t  APCTL1;                       /**< 0018: Pin Control 1 Register                                       */
} ADC_Type;

/**
 * @} */ /* End group ADC_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'ADC0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup ADC_Register_Masks_GROUP ADC Register Masks
* @brief Register Masks for ADC
* @{
*/
/* ------- SC1 Bit Fields                           ------ */
#define ADC_SC1_ADCH_MASK                        (0x1FU)                                             /*!< ADC0_SC1.ADCH Mask                      */
#define ADC_SC1_ADCH_SHIFT                       (0U)                                                /*!< ADC0_SC1.ADCH Position                  */
#define ADC_SC1_ADCH(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0x1FUL)          /*!< ADC0_SC1.ADCH Field                     */
#define ADC_SC1_ADCO_MASK                        (0x20U)                                             /*!< ADC0_SC1.ADCO Mask                      */
#define ADC_SC1_ADCO_SHIFT                       (5U)                                                /*!< ADC0_SC1.ADCO Position                  */
#define ADC_SC1_ADCO(x)                          (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< ADC0_SC1.ADCO Field                     */
#define ADC_SC1_AIEN_MASK                        (0x40U)                                             /*!< ADC0_SC1.AIEN Mask                      */
#define ADC_SC1_AIEN_SHIFT                       (6U)                                                /*!< ADC0_SC1.AIEN Position                  */
#define ADC_SC1_AIEN(x)                          (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< ADC0_SC1.AIEN Field                     */
#define ADC_SC1_COCO_MASK                        (0x80U)                                             /*!< ADC0_SC1.COCO Mask                      */
#define ADC_SC1_COCO_SHIFT                       (7U)                                                /*!< ADC0_SC1.COCO Position                  */
#define ADC_SC1_COCO(x)                          (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< ADC0_SC1.COCO Field                     */
/* ------- SC2 Bit Fields                           ------ */
#define ADC_SC2_REFSEL_MASK                      (0x3U)                                              /*!< ADC0_SC2.REFSEL Mask                    */
#define ADC_SC2_REFSEL_SHIFT                     (0U)                                                /*!< ADC0_SC2.REFSEL Position                */
#define ADC_SC2_REFSEL(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< ADC0_SC2.REFSEL Field                   */
#define ADC_SC2_FFULL_MASK                       (0x4U)                                              /*!< ADC0_SC2.FFULL Mask                     */
#define ADC_SC2_FFULL_SHIFT                      (2U)                                                /*!< ADC0_SC2.FFULL Position                 */
#define ADC_SC2_FFULL(x)                         (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< ADC0_SC2.FFULL Field                    */
#define ADC_SC2_FEMPTY_MASK                      (0x8U)                                              /*!< ADC0_SC2.FEMPTY Mask                    */
#define ADC_SC2_FEMPTY_SHIFT                     (3U)                                                /*!< ADC0_SC2.FEMPTY Position                */
#define ADC_SC2_FEMPTY(x)                        (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< ADC0_SC2.FEMPTY Field                   */
#define ADC_SC2_ACFGT_MASK                       (0x10U)                                             /*!< ADC0_SC2.ACFGT Mask                     */
#define ADC_SC2_ACFGT_SHIFT                      (4U)                                                /*!< ADC0_SC2.ACFGT Position                 */
#define ADC_SC2_ACFGT(x)                         (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< ADC0_SC2.ACFGT Field                    */
#define ADC_SC2_ACFE_MASK                        (0x20U)                                             /*!< ADC0_SC2.ACFE Mask                      */
#define ADC_SC2_ACFE_SHIFT                       (5U)                                                /*!< ADC0_SC2.ACFE Position                  */
#define ADC_SC2_ACFE(x)                          (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< ADC0_SC2.ACFE Field                     */
#define ADC_SC2_ADTRG_MASK                       (0x40U)                                             /*!< ADC0_SC2.ADTRG Mask                     */
#define ADC_SC2_ADTRG_SHIFT                      (6U)                                                /*!< ADC0_SC2.ADTRG Position                 */
#define ADC_SC2_ADTRG(x)                         (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< ADC0_SC2.ADTRG Field                    */
#define ADC_SC2_ADACT_MASK                       (0x80U)                                             /*!< ADC0_SC2.ADACT Mask                     */
#define ADC_SC2_ADACT_SHIFT                      (7U)                                                /*!< ADC0_SC2.ADACT Position                 */
#define ADC_SC2_ADACT(x)                         (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< ADC0_SC2.ADACT Field                    */
/* ------- SC3 Bit Fields                           ------ */
#define ADC_SC3_ADICLK_MASK                      (0x3U)                                              /*!< ADC0_SC3.ADICLK Mask                    */
#define ADC_SC3_ADICLK_SHIFT                     (0U)                                                /*!< ADC0_SC3.ADICLK Position                */
#define ADC_SC3_ADICLK(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< ADC0_SC3.ADICLK Field                   */
#define ADC_SC3_MODE_MASK                        (0xCU)                                              /*!< ADC0_SC3.MODE Mask                      */
#define ADC_SC3_MODE_SHIFT                       (2U)                                                /*!< ADC0_SC3.MODE Position                  */
#define ADC_SC3_MODE(x)                          (((uint32_t)(((uint32_t)(x))<<2U))&0xCUL)           /*!< ADC0_SC3.MODE Field                     */
#define ADC_SC3_ADLSMP_MASK                      (0x10U)                                             /*!< ADC0_SC3.ADLSMP Mask                    */
#define ADC_SC3_ADLSMP_SHIFT                     (4U)                                                /*!< ADC0_SC3.ADLSMP Position                */
#define ADC_SC3_ADLSMP(x)                        (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< ADC0_SC3.ADLSMP Field                   */
#define ADC_SC3_ADIV_MASK                        (0x60U)                                             /*!< ADC0_SC3.ADIV Mask                      */
#define ADC_SC3_ADIV_SHIFT                       (5U)                                                /*!< ADC0_SC3.ADIV Position                  */
#define ADC_SC3_ADIV(x)                          (((uint32_t)(((uint32_t)(x))<<5U))&0x60UL)          /*!< ADC0_SC3.ADIV Field                     */
#define ADC_SC3_ADLPC_MASK                       (0x80U)                                             /*!< ADC0_SC3.ADLPC Mask                     */
#define ADC_SC3_ADLPC_SHIFT                      (7U)                                                /*!< ADC0_SC3.ADLPC Position                 */
#define ADC_SC3_ADLPC(x)                         (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< ADC0_SC3.ADLPC Field                    */
/* ------- SC4 Bit Fields                           ------ */
#define ADC_SC4_AFDEP_MASK                       (0x7U)                                              /*!< ADC0_SC4.AFDEP Mask                     */
#define ADC_SC4_AFDEP_SHIFT                      (0U)                                                /*!< ADC0_SC4.AFDEP Position                 */
#define ADC_SC4_AFDEP(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< ADC0_SC4.AFDEP Field                    */
#define ADC_SC4_ACFSEL_MASK                      (0x20U)                                             /*!< ADC0_SC4.ACFSEL Mask                    */
#define ADC_SC4_ACFSEL_SHIFT                     (5U)                                                /*!< ADC0_SC4.ACFSEL Position                */
#define ADC_SC4_ACFSEL(x)                        (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< ADC0_SC4.ACFSEL Field                   */
#define ADC_SC4_ASCANE_MASK                      (0x40U)                                             /*!< ADC0_SC4.ASCANE Mask                    */
#define ADC_SC4_ASCANE_SHIFT                     (6U)                                                /*!< ADC0_SC4.ASCANE Position                */
#define ADC_SC4_ASCANE(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< ADC0_SC4.ASCANE Field                   */
/* ------- R Bit Fields                             ------ */
#define ADC_R_ADR_MASK                           (0xFFFU)                                            /*!< ADC0_R.ADR Mask                         */
#define ADC_R_ADR_SHIFT                          (0U)                                                /*!< ADC0_R.ADR Position                     */
#define ADC_R_ADR(x)                             (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFUL)         /*!< ADC0_R.ADR Field                        */
/* ------- CV Bit Fields                            ------ */
#define ADC_CV_CV_MASK                           (0xFFFU)                                            /*!< ADC0_CV.CV Mask                         */
#define ADC_CV_CV_SHIFT                          (0U)                                                /*!< ADC0_CV.CV Position                     */
#define ADC_CV_CV(x)                             (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFUL)         /*!< ADC0_CV.CV Field                        */
/* ------- APCTL1 Bit Fields                        ------ */
#define ADC_APCTL1_ADPC_MASK                     (0xFFFFU)                                           /*!< ADC0_APCTL1.ADPC Mask                   */
#define ADC_APCTL1_ADPC_SHIFT                    (0U)                                                /*!< ADC0_APCTL1.ADPC Position               */
#define ADC_APCTL1_ADPC(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ADC0_APCTL1.ADPC Field                  */
/**
 * @} */ /* End group ADC_Register_Masks_GROUP 
 */

