podonoghue/usbdm-firmware/BootLoopMKEx/Project_Headers/MKE02Z16M2.h
/* FGPIOA - Peripheral instance base addresses */
#define FGPIOA_BasePtr                 0xF8000000UL //!< Peripheral base address
#define FGPIOA                         ((GPIO_Type *) FGPIOA_BasePtr) //!< Freescale base pointer
#define FGPIOA_BASE_PTR                (FGPIOA) //!< Freescale style base pointer
/**
 * @} */ /* End group FGPIOA_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FGPIOB_Peripheral_access_layer_GROUP FGPIOB Peripheral Access Layer
* @brief C Struct for FGPIOB
* @{
*/

/* ================================================================================ */
/* ================           FGPIOB (file:FGPIOB_MKE)             ================ */
/* ================================================================================ */

/**
 * @brief General Purpose Input/Output
 */
/**
* @addtogroup FGPIOB_structs_GROUP FGPIOB struct
* @brief Struct for FGPIOB
* @{
*/
typedef struct {                                /*       FGPIOB Structure                                             */
   union {                                      /**< 0000: (size=0004)                                                  */
      __IO uint32_t  PDOR;                      /**< 0000: Port Data Output Register                                    */
      struct {                                  /**< 0000: (size=0004)                                                  */
         __IO uint8_t   PDORE;                  /**< 0000: Port Data Output Register                                    */
         __IO uint8_t   PDORF;                  /**< 0001: Port Data Output Register                                    */
         __IO uint8_t   PDORG;                  /**< 0002: Port Data Output Register                                    */
         __IO uint8_t   PDORH;                  /**< 0003: Port Data Output Register                                    */
      };
   };
   union {                                      /**< 0000: (size=0004)                                                  */
      __O  uint32_t  PSOR;                      /**< 0004: Port Set Output Register                                     */
      struct {                                  /**< 0000: (size=0004)                                                  */
         __O  uint8_t   PSORE;                  /**< 0004: Port Set Output Register                                     */
         __O  uint8_t   PSORF;                  /**< 0005: Port Set Output Register                                     */
         __O  uint8_t   PSORG;                  /**< 0006: Port Set Output Register                                     */
         __O  uint8_t   PSORH;                  /**< 0007: Port Set Output Register                                     */
      };
   };
   union {                                      /**< 0000: (size=0004)                                                  */
      __O  uint32_t  PCOR;                      /**< 0008: Port Clear Output Register                                   */
      struct {                                  /**< 0000: (size=0004)                                                  */
         __O  uint8_t   PCORE;                  /**< 0008: Port Clear Output Register                                   */
         __O  uint8_t   PCORF;                  /**< 0009: Port Clear Output Register                                   */
         __O  uint8_t   PCORG;                  /**< 000A: Port Clear Output Register                                   */
         __O  uint8_t   PCORH;                  /**< 000B: Port Clear Output Register                                   */
      };
   };
   union {                                      /**< 0000: (size=0004)                                                  */
      __O  uint32_t  PTOR;                      /**< 000C: Port Toggle Output Register                                  */
      struct {                                  /**< 0000: (size=0004)                                                  */
         __O  uint8_t   PTORE;                  /**< 000C: Port Toggle Output Register                                  */
         __O  uint8_t   PTORF;                  /**< 000D: Port Toggle Output Register                                  */
         __O  uint8_t   PTORG;                  /**< 000E: Port Toggle Output Register                                  */
         __O  uint8_t   PTORH;                  /**< 000F: Port Toggle Output Register                                  */
      };
   };
   union {                                      /**< 0000: (size=0004)                                                  */
      __I  uint32_t  PDIR;                      /**< 0010: Port Data Input Register                                     */
      struct {                                  /**< 0000: (size=0004)                                                  */
         __I  uint8_t   PDIRE;                  /**< 0010: Port Data Input Register                                     */
         __I  uint8_t   PDIRF;                  /**< 0011: Port Data Input Register                                     */
         __I  uint8_t   PDIRG;                  /**< 0012: Port Data Input Register                                     */
         __I  uint8_t   PDIRH;                  /**< 0013: Port Data Input Register                                     */
      };
   };
   union {                                      /**< 0000: (size=0004)                                                  */
      __IO uint32_t  PDDR;                      /**< 0014: Port Data Direction Register                                 */
      struct {                                  /**< 0000: (size=0004)                                                  */
         __IO uint8_t   PDDRE;                  /**< 0014: Port Data Direction Register                                 */
         __IO uint8_t   PDDRF;                  /**< 0015: Port Data Direction Register                                 */
         __IO uint8_t   PDDRG;                  /**< 0016: Port Data Direction Register                                 */
         __IO uint8_t   PDDRH;                  /**< 0017: Port Data Direction Register                                 */
      };
   };
   union {                                      /**< 0000: (size=0004)                                                  */
      __IO uint32_t  PIDR;                      /**< 0018: Port Input Disable Register                                  */
      struct {                                  /**< 0000: (size=0004)                                                  */
         __IO uint8_t   PIDRE;                  /**< 0018: Port Input Disable Register                                  */
         __IO uint8_t   PIDRF;                  /**< 0019: Port Input Disable Register                                  */
         __IO uint8_t   PIDRG;                  /**< 001A: Port Input Disable Register                                  */
         __IO uint8_t   PIDRH;                  /**< 001B: Port Input Disable Register                                  */
      };
   };
} FGPIOB_Type;

/**
 * @} */ /* End group FGPIOB_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'FGPIOB' Position & Mask macros                      ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup FGPIOB_Register_Masks_GROUP FGPIOB Register Masks
* @brief Register Masks for FGPIOB
* @{
*/
/* ------- PDOR Bit Fields                          ------ */
/* ------- PDORE Bit Fields                         ------ */
/* ------- PSOR Bit Fields                          ------ */
/* ------- PSORE Bit Fields                         ------ */
/* ------- PCOR Bit Fields                          ------ */
/* ------- PCORE Bit Fields                         ------ */
/* ------- PTOR Bit Fields                          ------ */
/* ------- PTORE Bit Fields                         ------ */
/* ------- PDIR Bit Fields                          ------ */
/* ------- PDIRE Bit Fields                         ------ */
/* ------- PDDR Bit Fields                          ------ */
/* ------- PDDRE Bit Fields                         ------ */
/* ------- PIDR Bit Fields                          ------ */
/* ------- PIDRE Bit Fields                         ------ */
/**
 * @} */ /* End group FGPIOB_Register_Masks_GROUP 
 */

/* FGPIOB - Peripheral instance base addresses */
#define FGPIOB_BasePtr                 0xF8000040UL //!< Peripheral base address
#define FGPIOB                         ((FGPIOB_Type *) FGPIOB_BasePtr) //!< Freescale base pointer
#define FGPIOB_BASE_PTR                (FGPIOB) //!< Freescale style base pointer
/**
 * @} */ /* End group FGPIOB_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FGPIOC_Peripheral_access_layer_GROUP FGPIOC Peripheral Access Layer
* @brief C Struct for FGPIOC
* @{
*/

/* ================================================================================ */
/* ================           FGPIOC (file:FGPIOC_MKE)             ================ */
/* ================================================================================ */

/**
 * @brief General Purpose Input/Output
 */
/**
* @addtogroup FGPIOC_structs_GROUP FGPIOC struct
* @brief Struct for FGPIOC
* @{
*/
typedef struct {                                /*       FGPIOC Structure                                             */
   union {                                      /**< 0000: (size=0004)                                                  */
      __IO uint32_t  PDOR;                      /**< 0000: Port Data Output Register                                    */
      __IO uint8_t   PDORI;                     /**< 0000: Port Data Output Register                                    */
   };
   union {                                      /**< 0000: (size=0004)                                                  */
      __O  uint32_t  PSOR;                      /**< 0004: Port Set Output Register                                     */
      __O  uint8_t   PSORI;                     /**< 0004: Port Set Output Register                                     */
   };
   union {                                      /**< 0000: (size=0004)                                                  */
      __O  uint32_t  PCOR;                      /**< 0008: Port Clear Output Register                                   */
      __O  uint8_t   PCORI;                     /**< 0008: Port Clear Output Register                                   */
   };
   union {                                      /**< 0000: (size=0004)                                                  */
      __O  uint32_t  PTOR;                      /**< 000C: Port Toggle Output Register                                  */
      __O  uint8_t   PTORI;                     /**< 000C: Port Toggle Output Register                                  */
   };
   union {                                      /**< 0000: (size=0004)                                                  */
      __I  uint32_t  PDIR;                      /**< 0010: Port Data Input Register                                     */
      __I  uint8_t   PDIRI;                     /**< 0010: Port Data Input Register                                     */
   };
   union {                                      /**< 0000: (size=0004)                                                  */
      __IO uint32_t  PDDR;                      /**< 0014: Port Data Direction Register                                 */
      __IO uint8_t   PDDRI;                     /**< 0014: Port Data Direction Register                                 */
   };
   union {                                      /**< 0000: (size=0004)                                                  */
      __IO uint32_t  PIDR;                      /**< 0018: Port Input Disable Register                                  */
      __IO uint8_t   PIDRI;                     /**< 0018: Port Input Disable Register                                  */
   };
} FGPIOC_Type;

/**
 * @} */ /* End group FGPIOC_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'FGPIOC' Position & Mask macros                      ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup FGPIOC_Register_Masks_GROUP FGPIOC Register Masks
* @brief Register Masks for FGPIOC
* @{
*/
/* ------- PDOR Bit Fields                          ------ */
/* ------- PDORI Bit Fields                         ------ */
/* ------- PSOR Bit Fields                          ------ */
/* ------- PSORI Bit Fields                         ------ */
/* ------- PCOR Bit Fields                          ------ */
/* ------- PCORI Bit Fields                         ------ */
/* ------- PTOR Bit Fields                          ------ */
/* ------- PTORI Bit Fields                         ------ */
/* ------- PDIR Bit Fields                          ------ */
/* ------- PDIRI Bit Fields                         ------ */
/* ------- PDDR Bit Fields                          ------ */
/* ------- PDDRI Bit Fields                         ------ */
/* ------- PIDR Bit Fields                          ------ */
/* ------- PIDRI Bit Fields                         ------ */
/**
 * @} */ /* End group FGPIOC_Register_Masks_GROUP 
 */

/* FGPIOC - Peripheral instance base addresses */
#define FGPIOC_BasePtr                 0xF8000000UL //!< Peripheral base address
#define FGPIOC                         ((FGPIOC_Type *) FGPIOC_BasePtr) //!< Freescale base pointer
#define FGPIOC_BASE_PTR                (FGPIOC) //!< Freescale style base pointer
/**
 * @} */ /* End group FGPIOC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FTM_Peripheral_access_layer_GROUP FTM Peripheral Access Layer
* @brief C Struct for FTM
* @{
*/

/* ================================================================================ */
/* ================           FTM0 (file:FTM0_2CH_MKE)             ================ */
/* ================================================================================ */

/**
 * @brief FlexTimer Module (2 channels)
 */
/**
* @addtogroup FTM_structs_GROUP FTM struct
* @brief Struct for FTM
* @{
*/
typedef struct {                                /*       FTM0 Structure                                               */
   __IO uint32_t  SC;                           /**< 0000: Status and Control                                           */
   __IO uint32_t  CNT;                          /**< 0004: Counter                                                      */
   __IO uint32_t  MOD;                          /**< 0008: Modulo                                                       */
   struct {
      __IO uint32_t  CnSC;                      /**< 000C: Channel  Status and Control                                  */
      __IO uint32_t  CnV;                       /**< 0010: Channel  Value                                               */
   } CONTROLS[2];                               /**< 000C: (cluster: size=0x0010, 16)                                   */
        uint8_t   RESERVED_1[48];              
   __IO uint32_t  CNTIN;                        /**< 004C: Counter Initial Value                                        */
   __IO uint32_t  STATUS;                       /**< 0050: Capture and Compare Status                                   */
   __IO uint32_t  MODE;                         /**< 0054: Features Mode Selection                                      */
   __IO uint32_t  SYNC;                         /**< 0058: Synchronization                                              */
   __IO uint32_t  OUTINIT;                      /**< 005C: Initial State for Channels Output                            */
   __IO uint32_t  OUTMASK;                      /**< 0060: Output Mask                                                  */
   __IO uint32_t  COMBINE;                      /**< 0064: Function for Linked Channels                                 */
   __IO uint32_t  DEADTIME;                     /**< 0068: Deadtime Insertion Control                                   */
   __IO uint32_t  EXTTRIG;                      /**< 006C: FTM External Trigger                                         */
   __IO uint32_t  POL;                          /**< 0070: Channels Polarity                                            */
   __IO uint32_t  FMS;                          /**< 0074: Fault Mode Status                                            */
   __IO uint32_t  FILTER;                       /**< 0078: Input Capture Filter Control                                 */
   __IO uint32_t  FLTCTRL;                      /**< 007C: Fault Control                                                */
        uint8_t   RESERVED_2[4];               
   __IO uint32_t  CONF;                         /**< 0084: Configuration                                                */
   __IO uint32_t  FLTPOL;                       /**< 0088: FTM Fault Input Polarity                                     */
   __IO uint32_t  SYNCONF;                      /**< 008C: Synchronization Configuration                                */
   __IO uint32_t  INVCTRL;                      /**< 0090: FTM Inverting Control                                        */
   __IO uint32_t  SWOCTRL;                      /**< 0094: FTM Software Output Control                                  */
   __IO uint32_t  PWMLOAD;                      /**< 0098: FTM PWM Load                                                 */
} FTM_2CH_Type;

/**
 * @} */ /* End group FTM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'FTM0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

