podonoghue/usbdm-firmware/BootLoopMKEx/Project_Headers/MKE02Z16M2.h
/**
* @addtogroup FTMRH_Register_Masks_GROUP FTMRH Register Masks
* @brief Register Masks for FTMRH
* @{
*/
/* ------- FCLKDIV Bit Fields                       ------ */
#define FTMRH_FCLKDIV_FDIV_MASK                  (0x3FU)                                             /*!< FTMRH_FCLKDIV.FDIV Mask                 */
#define FTMRH_FCLKDIV_FDIV_SHIFT                 (0U)                                                /*!< FTMRH_FCLKDIV.FDIV Position             */
#define FTMRH_FCLKDIV_FDIV(x)                    (((uint8_t)(((uint8_t)(x))<<0U))&0x3FUL)            /*!< FTMRH_FCLKDIV.FDIV Field                */
#define FTMRH_FCLKDIV_FDIVLCK_MASK               (0x40U)                                             /*!< FTMRH_FCLKDIV.FDIVLCK Mask              */
#define FTMRH_FCLKDIV_FDIVLCK_SHIFT              (6U)                                                /*!< FTMRH_FCLKDIV.FDIVLCK Position          */
#define FTMRH_FCLKDIV_FDIVLCK(x)                 (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< FTMRH_FCLKDIV.FDIVLCK Field             */
#define FTMRH_FCLKDIV_FDIVLD_MASK                (0x80U)                                             /*!< FTMRH_FCLKDIV.FDIVLD Mask               */
#define FTMRH_FCLKDIV_FDIVLD_SHIFT               (7U)                                                /*!< FTMRH_FCLKDIV.FDIVLD Position           */
#define FTMRH_FCLKDIV_FDIVLD(x)                  (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< FTMRH_FCLKDIV.FDIVLD Field              */
/* ------- FSEC Bit Fields                          ------ */
#define FTMRH_FSEC_SEC_MASK                      (0x3U)                                              /*!< FTMRH_FSEC.SEC Mask                     */
#define FTMRH_FSEC_SEC_SHIFT                     (0U)                                                /*!< FTMRH_FSEC.SEC Position                 */
#define FTMRH_FSEC_SEC(x)                        (((uint8_t)(((uint8_t)(x))<<0U))&0x3UL)             /*!< FTMRH_FSEC.SEC Field                    */
#define FTMRH_FSEC_KEYEN_MASK                    (0xC0U)                                             /*!< FTMRH_FSEC.KEYEN Mask                   */
#define FTMRH_FSEC_KEYEN_SHIFT                   (6U)                                                /*!< FTMRH_FSEC.KEYEN Position               */
#define FTMRH_FSEC_KEYEN(x)                      (((uint8_t)(((uint8_t)(x))<<6U))&0xC0UL)            /*!< FTMRH_FSEC.KEYEN Field                  */
/* ------- FCCOBIX Bit Fields                       ------ */
#define FTMRH_FCCOBIX_CCOBIX_MASK                (0x7U)                                              /*!< FTMRH_FCCOBIX.CCOBIX Mask               */
#define FTMRH_FCCOBIX_CCOBIX_SHIFT               (0U)                                                /*!< FTMRH_FCCOBIX.CCOBIX Position           */
#define FTMRH_FCCOBIX_CCOBIX(x)                  (((uint8_t)(((uint8_t)(x))<<0U))&0x7UL)             /*!< FTMRH_FCCOBIX.CCOBIX Field              */
/* ------- FCNFG Bit Fields                         ------ */
#define FTMRH_FCNFG_FSFD_MASK                    (0x1U)                                              /*!< FTMRH_FCNFG.FSFD Mask                   */
#define FTMRH_FCNFG_FSFD_SHIFT                   (0U)                                                /*!< FTMRH_FCNFG.FSFD Position               */
#define FTMRH_FCNFG_FSFD(x)                      (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< FTMRH_FCNFG.FSFD Field                  */
#define FTMRH_FCNFG_FDFD_MASK                    (0x2U)                                              /*!< FTMRH_FCNFG.FDFD Mask                   */
#define FTMRH_FCNFG_FDFD_SHIFT                   (1U)                                                /*!< FTMRH_FCNFG.FDFD Position               */
#define FTMRH_FCNFG_FDFD(x)                      (((uint8_t)(((uint8_t)(x))<<1U))&0x2UL)             /*!< FTMRH_FCNFG.FDFD Field                  */
#define FTMRH_FCNFG_IGNSF_MASK                   (0x10U)                                             /*!< FTMRH_FCNFG.IGNSF Mask                  */
#define FTMRH_FCNFG_IGNSF_SHIFT                  (4U)                                                /*!< FTMRH_FCNFG.IGNSF Position              */
#define FTMRH_FCNFG_IGNSF(x)                     (((uint8_t)(((uint8_t)(x))<<4U))&0x10UL)            /*!< FTMRH_FCNFG.IGNSF Field                 */
#define FTMRH_FCNFG_CCIE_MASK                    (0x80U)                                             /*!< FTMRH_FCNFG.CCIE Mask                   */
#define FTMRH_FCNFG_CCIE_SHIFT                   (7U)                                                /*!< FTMRH_FCNFG.CCIE Position               */
#define FTMRH_FCNFG_CCIE(x)                      (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< FTMRH_FCNFG.CCIE Field                  */
/* ------- FERCNFG Bit Fields                       ------ */
#define FTMRH_FERCNFG_SFDIE_MASK                 (0x1U)                                              /*!< FTMRH_FERCNFG.SFDIE Mask                */
#define FTMRH_FERCNFG_SFDIE_SHIFT                (0U)                                                /*!< FTMRH_FERCNFG.SFDIE Position            */
#define FTMRH_FERCNFG_SFDIE(x)                   (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< FTMRH_FERCNFG.SFDIE Field               */
#define FTMRH_FERCNFG_DFDIE_MASK                 (0x2U)                                              /*!< FTMRH_FERCNFG.DFDIE Mask                */
#define FTMRH_FERCNFG_DFDIE_SHIFT                (1U)                                                /*!< FTMRH_FERCNFG.DFDIE Position            */
#define FTMRH_FERCNFG_DFDIE(x)                   (((uint8_t)(((uint8_t)(x))<<1U))&0x2UL)             /*!< FTMRH_FERCNFG.DFDIE Field               */
/* ------- FSTAT Bit Fields                         ------ */
#define FTMRH_FSTAT_MGSTAT_MASK                  (0x3U)                                              /*!< FTMRH_FSTAT.MGSTAT Mask                 */
#define FTMRH_FSTAT_MGSTAT_SHIFT                 (0U)                                                /*!< FTMRH_FSTAT.MGSTAT Position             */
#define FTMRH_FSTAT_MGSTAT(x)                    (((uint8_t)(((uint8_t)(x))<<0U))&0x3UL)             /*!< FTMRH_FSTAT.MGSTAT Field                */
#define FTMRH_FSTAT_MGBUSY_MASK                  (0x8U)                                              /*!< FTMRH_FSTAT.MGBUSY Mask                 */
#define FTMRH_FSTAT_MGBUSY_SHIFT                 (3U)                                                /*!< FTMRH_FSTAT.MGBUSY Position             */
#define FTMRH_FSTAT_MGBUSY(x)                    (((uint8_t)(((uint8_t)(x))<<3U))&0x8UL)             /*!< FTMRH_FSTAT.MGBUSY Field                */
#define FTMRH_FSTAT_FPVIOL_MASK                  (0x10U)                                             /*!< FTMRH_FSTAT.FPVIOL Mask                 */
#define FTMRH_FSTAT_FPVIOL_SHIFT                 (4U)                                                /*!< FTMRH_FSTAT.FPVIOL Position             */
#define FTMRH_FSTAT_FPVIOL(x)                    (((uint8_t)(((uint8_t)(x))<<4U))&0x10UL)            /*!< FTMRH_FSTAT.FPVIOL Field                */
#define FTMRH_FSTAT_ACCERR_MASK                  (0x20U)                                             /*!< FTMRH_FSTAT.ACCERR Mask                 */
#define FTMRH_FSTAT_ACCERR_SHIFT                 (5U)                                                /*!< FTMRH_FSTAT.ACCERR Position             */
#define FTMRH_FSTAT_ACCERR(x)                    (((uint8_t)(((uint8_t)(x))<<5U))&0x20UL)            /*!< FTMRH_FSTAT.ACCERR Field                */
#define FTMRH_FSTAT_CCIF_MASK                    (0x80U)                                             /*!< FTMRH_FSTAT.CCIF Mask                   */
#define FTMRH_FSTAT_CCIF_SHIFT                   (7U)                                                /*!< FTMRH_FSTAT.CCIF Position               */
#define FTMRH_FSTAT_CCIF(x)                      (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< FTMRH_FSTAT.CCIF Field                  */
/* ------- FERSTAT Bit Fields                       ------ */
#define FTMRH_FERSTAT_SFDIF_MASK                 (0x1U)                                              /*!< FTMRH_FERSTAT.SFDIF Mask                */
#define FTMRH_FERSTAT_SFDIF_SHIFT                (0U)                                                /*!< FTMRH_FERSTAT.SFDIF Position            */
#define FTMRH_FERSTAT_SFDIF(x)                   (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< FTMRH_FERSTAT.SFDIF Field               */
#define FTMRH_FERSTAT_DFDIF_MASK                 (0x2U)                                              /*!< FTMRH_FERSTAT.DFDIF Mask                */
#define FTMRH_FERSTAT_DFDIF_SHIFT                (1U)                                                /*!< FTMRH_FERSTAT.DFDIF Position            */
#define FTMRH_FERSTAT_DFDIF(x)                   (((uint8_t)(((uint8_t)(x))<<1U))&0x2UL)             /*!< FTMRH_FERSTAT.DFDIF Field               */
/* ------- FPROT Bit Fields                         ------ */
#define FTMRH_FPROT_FPLS_MASK                    (0x3U)                                              /*!< FTMRH_FPROT.FPLS Mask                   */
#define FTMRH_FPROT_FPLS_SHIFT                   (0U)                                                /*!< FTMRH_FPROT.FPLS Position               */
#define FTMRH_FPROT_FPLS(x)                      (((uint8_t)(((uint8_t)(x))<<0U))&0x3UL)             /*!< FTMRH_FPROT.FPLS Field                  */
#define FTMRH_FPROT_FPLDIS_MASK                  (0x4U)                                              /*!< FTMRH_FPROT.FPLDIS Mask                 */
#define FTMRH_FPROT_FPLDIS_SHIFT                 (2U)                                                /*!< FTMRH_FPROT.FPLDIS Position             */
#define FTMRH_FPROT_FPLDIS(x)                    (((uint8_t)(((uint8_t)(x))<<2U))&0x4UL)             /*!< FTMRH_FPROT.FPLDIS Field                */
#define FTMRH_FPROT_FPHS_MASK                    (0x18U)                                             /*!< FTMRH_FPROT.FPHS Mask                   */
#define FTMRH_FPROT_FPHS_SHIFT                   (3U)                                                /*!< FTMRH_FPROT.FPHS Position               */
#define FTMRH_FPROT_FPHS(x)                      (((uint8_t)(((uint8_t)(x))<<3U))&0x18UL)            /*!< FTMRH_FPROT.FPHS Field                  */
#define FTMRH_FPROT_FPHDIS_MASK                  (0x20U)                                             /*!< FTMRH_FPROT.FPHDIS Mask                 */
#define FTMRH_FPROT_FPHDIS_SHIFT                 (5U)                                                /*!< FTMRH_FPROT.FPHDIS Position             */
#define FTMRH_FPROT_FPHDIS(x)                    (((uint8_t)(((uint8_t)(x))<<5U))&0x20UL)            /*!< FTMRH_FPROT.FPHDIS Field                */
#define FTMRH_FPROT_FPOPEN_MASK                  (0x80U)                                             /*!< FTMRH_FPROT.FPOPEN Mask                 */
#define FTMRH_FPROT_FPOPEN_SHIFT                 (7U)                                                /*!< FTMRH_FPROT.FPOPEN Position             */
#define FTMRH_FPROT_FPOPEN(x)                    (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< FTMRH_FPROT.FPOPEN Field                */
/* ------- EEPROT Bit Fields                        ------ */
#define FTMRH_EEPROT_DPS_MASK                    (0x7U)                                              /*!< FTMRH_EEPROT.DPS Mask                   */
#define FTMRH_EEPROT_DPS_SHIFT                   (0U)                                                /*!< FTMRH_EEPROT.DPS Position               */
#define FTMRH_EEPROT_DPS(x)                      (((uint8_t)(((uint8_t)(x))<<0U))&0x7UL)             /*!< FTMRH_EEPROT.DPS Field                  */
#define FTMRH_EEPROT_DPOPEN_MASK                 (0x80U)                                             /*!< FTMRH_EEPROT.DPOPEN Mask                */
#define FTMRH_EEPROT_DPOPEN_SHIFT                (7U)                                                /*!< FTMRH_EEPROT.DPOPEN Position            */
#define FTMRH_EEPROT_DPOPEN(x)                   (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< FTMRH_EEPROT.DPOPEN Field               */
/* ------- FCCOB Bit Fields                         ------ */
/* ------- FCCOBHI Bit Fields                       ------ */
/* ------- FCCOBLO Bit Fields                       ------ */
/* ------- FOPT Bit Fields                          ------ */
/**
 * @} */ /* End group FTMRH_Register_Masks_GROUP 
 */

/* FTMRH - Peripheral instance base addresses */
#define FTMRH_BasePtr                  0x40020000UL //!< Peripheral base address
#define FTMRH                          ((FTMRH_Type *) FTMRH_BasePtr) //!< Freescale base pointer
#define FTMRH_BASE_PTR                 (FTMRH) //!< Freescale style base pointer
/**
 * @} */ /* End group FTMRH_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FGPIOA_Peripheral_access_layer_GROUP FGPIOA Peripheral Access Layer
* @brief C Struct for FGPIOA
* @{
*/

/* ================================================================================ */
/* ================           GPIOA (derived from FGPIOA)          ================ */
/* ================================================================================ */

/**
 * @brief General Purpose Input/Output
 */

/* GPIOA - Peripheral instance base addresses */
#define GPIOA_BasePtr                  0x400FF000UL //!< Peripheral base address
#define GPIOA                          ((GPIO_Type *) GPIOA_BasePtr) //!< Freescale base pointer
#define GPIOA_BASE_PTR                 (GPIOA) //!< Freescale style base pointer
/**
 * @} */ /* End group FGPIOA_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FGPIOB_Peripheral_access_layer_GROUP FGPIOB Peripheral Access Layer
* @brief C Struct for FGPIOB
* @{
*/

/* ================================================================================ */
/* ================           GPIOB (derived from FGPIOB)          ================ */
/* ================================================================================ */

/**
 * @brief General Purpose Input/Output
 */

/* GPIOB - Peripheral instance base addresses */
#define GPIOB_BasePtr                  0x400FF040UL //!< Peripheral base address
#define GPIOB                          ((FGPIOB_Type *) GPIOB_BasePtr) //!< Freescale base pointer
#define GPIOB_BASE_PTR                 (GPIOB) //!< Freescale style base pointer
/**
 * @} */ /* End group FGPIOB_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FGPIOC_Peripheral_access_layer_GROUP FGPIOC Peripheral Access Layer
* @brief C Struct for FGPIOC
* @{
*/

/* ================================================================================ */
/* ================           GPIOC (derived from FGPIOC)          ================ */
/* ================================================================================ */

/**
 * @brief General Purpose Input/Output
 */

