podonoghue/usbdm-firmware/BootLoopMKEx/Project_Headers/MKE02Z16M2.h
/**
* @addtogroup ICS_Register_Masks_GROUP ICS Register Masks
* @brief Register Masks for ICS
* @{
*/
/* ------- C1 Bit Fields                            ------ */
#define ICS_C1_IREFSTEN_MASK                     (0x1U)                                              /*!< ICS_C1.IREFSTEN Mask                    */
#define ICS_C1_IREFSTEN_SHIFT                    (0U)                                                /*!< ICS_C1.IREFSTEN Position                */
#define ICS_C1_IREFSTEN(x)                       (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< ICS_C1.IREFSTEN Field                   */
#define ICS_C1_IRCLKEN_MASK                      (0x2U)                                              /*!< ICS_C1.IRCLKEN Mask                     */
#define ICS_C1_IRCLKEN_SHIFT                     (1U)                                                /*!< ICS_C1.IRCLKEN Position                 */
#define ICS_C1_IRCLKEN(x)                        (((uint8_t)(((uint8_t)(x))<<1U))&0x2UL)             /*!< ICS_C1.IRCLKEN Field                    */
#define ICS_C1_IREFS_MASK                        (0x4U)                                              /*!< ICS_C1.IREFS Mask                       */
#define ICS_C1_IREFS_SHIFT                       (2U)                                                /*!< ICS_C1.IREFS Position                   */
#define ICS_C1_IREFS(x)                          (((uint8_t)(((uint8_t)(x))<<2U))&0x4UL)             /*!< ICS_C1.IREFS Field                      */
#define ICS_C1_RDIV_MASK                         (0x38U)                                             /*!< ICS_C1.RDIV Mask                        */
#define ICS_C1_RDIV_SHIFT                        (3U)                                                /*!< ICS_C1.RDIV Position                    */
#define ICS_C1_RDIV(x)                           (((uint8_t)(((uint8_t)(x))<<3U))&0x38UL)            /*!< ICS_C1.RDIV Field                       */
#define ICS_C1_CLKS_MASK                         (0xC0U)                                             /*!< ICS_C1.CLKS Mask                        */
#define ICS_C1_CLKS_SHIFT                        (6U)                                                /*!< ICS_C1.CLKS Position                    */
#define ICS_C1_CLKS(x)                           (((uint8_t)(((uint8_t)(x))<<6U))&0xC0UL)            /*!< ICS_C1.CLKS Field                       */
/* ------- C2 Bit Fields                            ------ */
#define ICS_C2_LP_MASK                           (0x10U)                                             /*!< ICS_C2.LP Mask                          */
#define ICS_C2_LP_SHIFT                          (4U)                                                /*!< ICS_C2.LP Position                      */
#define ICS_C2_LP(x)                             (((uint8_t)(((uint8_t)(x))<<4U))&0x10UL)            /*!< ICS_C2.LP Field                         */
#define ICS_C2_BDIV_MASK                         (0xE0U)                                             /*!< ICS_C2.BDIV Mask                        */
#define ICS_C2_BDIV_SHIFT                        (5U)                                                /*!< ICS_C2.BDIV Position                    */
#define ICS_C2_BDIV(x)                           (((uint8_t)(((uint8_t)(x))<<5U))&0xE0UL)            /*!< ICS_C2.BDIV Field                       */
/* ------- C3 Bit Fields                            ------ */
#define ICS_C3_SCTRIM_MASK                       (0xFFU)                                             /*!< ICS_C3.SCTRIM Mask                      */
#define ICS_C3_SCTRIM_SHIFT                      (0U)                                                /*!< ICS_C3.SCTRIM Position                  */
#define ICS_C3_SCTRIM(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< ICS_C3.SCTRIM Field                     */
/* ------- C4 Bit Fields                            ------ */
#define ICS_C4_SCFTRIM_MASK                      (0x1U)                                              /*!< ICS_C4.SCFTRIM Mask                     */
#define ICS_C4_SCFTRIM_SHIFT                     (0U)                                                /*!< ICS_C4.SCFTRIM Position                 */
#define ICS_C4_SCFTRIM(x)                        (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< ICS_C4.SCFTRIM Field                    */
#define ICS_C4_CME_MASK                          (0x20U)                                             /*!< ICS_C4.CME Mask                         */
#define ICS_C4_CME_SHIFT                         (5U)                                                /*!< ICS_C4.CME Position                     */
#define ICS_C4_CME(x)                            (((uint8_t)(((uint8_t)(x))<<5U))&0x20UL)            /*!< ICS_C4.CME Field                        */
#define ICS_C4_LOLIE0_MASK                       (0x80U)                                             /*!< ICS_C4.LOLIE0 Mask                      */
#define ICS_C4_LOLIE0_SHIFT                      (7U)                                                /*!< ICS_C4.LOLIE0 Position                  */
#define ICS_C4_LOLIE0(x)                         (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< ICS_C4.LOLIE0 Field                     */
/* ------- S Bit Fields                             ------ */
#define ICS_S_CLKST_MASK                         (0xCU)                                              /*!< ICS_S.CLKST Mask                        */
#define ICS_S_CLKST_SHIFT                        (2U)                                                /*!< ICS_S.CLKST Position                    */
#define ICS_S_CLKST(x)                           (((uint8_t)(((uint8_t)(x))<<2U))&0xCUL)             /*!< ICS_S.CLKST Field                       */
#define ICS_S_IREFST_MASK                        (0x10U)                                             /*!< ICS_S.IREFST Mask                       */
#define ICS_S_IREFST_SHIFT                       (4U)                                                /*!< ICS_S.IREFST Position                   */
#define ICS_S_IREFST(x)                          (((uint8_t)(((uint8_t)(x))<<4U))&0x10UL)            /*!< ICS_S.IREFST Field                      */
#define ICS_S_LOCK_MASK                          (0x40U)                                             /*!< ICS_S.LOCK Mask                         */
#define ICS_S_LOCK_SHIFT                         (6U)                                                /*!< ICS_S.LOCK Position                     */
#define ICS_S_LOCK(x)                            (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< ICS_S.LOCK Field                        */
#define ICS_S_LOLS_MASK                          (0x80U)                                             /*!< ICS_S.LOLS Mask                         */
#define ICS_S_LOLS_SHIFT                         (7U)                                                /*!< ICS_S.LOLS Position                     */
#define ICS_S_LOLS(x)                            (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< ICS_S.LOLS Field                        */
/**
 * @} */ /* End group ICS_Register_Masks_GROUP 
 */

/* ICS - Peripheral instance base addresses */
#define ICS_BasePtr                    0x40064000UL //!< Peripheral base address
#define ICS                            ((ICS_Type *) ICS_BasePtr) //!< Freescale base pointer
#define ICS_BASE_PTR                   (ICS) //!< Freescale style base pointer
/**
 * @} */ /* End group ICS_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup IRQ_Peripheral_access_layer_GROUP IRQ Peripheral Access Layer
* @brief C Struct for IRQ
* @{
*/

/* ================================================================================ */
/* ================           IRQ (file:IRQ_MKE)                   ================ */
/* ================================================================================ */

/**
 * @brief Interrupt
 */
/**
* @addtogroup IRQ_structs_GROUP IRQ struct
* @brief Struct for IRQ
* @{
*/
typedef struct {                                /*       IRQ Structure                                                */
   __IO uint8_t   SC;                           /**< 0000: Interrupt Pin Request Status and Control Register            */
} IRQ_Type;

/**
 * @} */ /* End group IRQ_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'IRQ' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup IRQ_Register_Masks_GROUP IRQ Register Masks
* @brief Register Masks for IRQ
* @{
*/
/* ------- SC Bit Fields                            ------ */
#define IRQ_SC_IRQMOD_MASK                       (0x1U)                                              /*!< IRQ_SC.IRQMOD Mask                      */
#define IRQ_SC_IRQMOD_SHIFT                      (0U)                                                /*!< IRQ_SC.IRQMOD Position                  */
#define IRQ_SC_IRQMOD(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< IRQ_SC.IRQMOD Field                     */
#define IRQ_SC_IRQIE_MASK                        (0x2U)                                              /*!< IRQ_SC.IRQIE Mask                       */
#define IRQ_SC_IRQIE_SHIFT                       (1U)                                                /*!< IRQ_SC.IRQIE Position                   */
#define IRQ_SC_IRQIE(x)                          (((uint8_t)(((uint8_t)(x))<<1U))&0x2UL)             /*!< IRQ_SC.IRQIE Field                      */
#define IRQ_SC_IRQACK_MASK                       (0x4U)                                              /*!< IRQ_SC.IRQACK Mask                      */
#define IRQ_SC_IRQACK_SHIFT                      (2U)                                                /*!< IRQ_SC.IRQACK Position                  */
#define IRQ_SC_IRQACK(x)                         (((uint8_t)(((uint8_t)(x))<<2U))&0x4UL)             /*!< IRQ_SC.IRQACK Field                     */
#define IRQ_SC_IRQF_MASK                         (0x8U)                                              /*!< IRQ_SC.IRQF Mask                        */
#define IRQ_SC_IRQF_SHIFT                        (3U)                                                /*!< IRQ_SC.IRQF Position                    */
#define IRQ_SC_IRQF(x)                           (((uint8_t)(((uint8_t)(x))<<3U))&0x8UL)             /*!< IRQ_SC.IRQF Field                       */
#define IRQ_SC_IRQPE_MASK                        (0x10U)                                             /*!< IRQ_SC.IRQPE Mask                       */
#define IRQ_SC_IRQPE_SHIFT                       (4U)                                                /*!< IRQ_SC.IRQPE Position                   */
#define IRQ_SC_IRQPE(x)                          (((uint8_t)(((uint8_t)(x))<<4U))&0x10UL)            /*!< IRQ_SC.IRQPE Field                      */
#define IRQ_SC_IRQEDG_MASK                       (0x20U)                                             /*!< IRQ_SC.IRQEDG Mask                      */
#define IRQ_SC_IRQEDG_SHIFT                      (5U)                                                /*!< IRQ_SC.IRQEDG Position                  */
#define IRQ_SC_IRQEDG(x)                         (((uint8_t)(((uint8_t)(x))<<5U))&0x20UL)            /*!< IRQ_SC.IRQEDG Field                     */
#define IRQ_SC_IRQPDD_MASK                       (0x40U)                                             /*!< IRQ_SC.IRQPDD Mask                      */
#define IRQ_SC_IRQPDD_SHIFT                      (6U)                                                /*!< IRQ_SC.IRQPDD Position                  */
#define IRQ_SC_IRQPDD(x)                         (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< IRQ_SC.IRQPDD Field                     */
/**
 * @} */ /* End group IRQ_Register_Masks_GROUP 
 */

/* IRQ - Peripheral instance base addresses */
#define IRQ_BasePtr                    0x40031000UL //!< Peripheral base address
#define IRQ                            ((IRQ_Type *) IRQ_BasePtr) //!< Freescale base pointer
#define IRQ_BASE_PTR                   (IRQ) //!< Freescale style base pointer
/**
 * @} */ /* End group IRQ_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup KBI_Peripheral_access_layer_GROUP KBI Peripheral Access Layer
* @brief C Struct for KBI
* @{
*/

/* ================================================================================ */
/* ================           KBI0 (file:KBI0_MKE02)               ================ */
/* ================================================================================ */

/**
 * @brief Keyboard interrupts
 */
/**
* @addtogroup KBI_structs_GROUP KBI struct
* @brief Struct for KBI
* @{
*/
typedef struct {                                /*       KBI0 Structure                                               */
   __IO uint8_t   SC;                           /**< 0000: KBI Status and Control Register                              */
   __IO uint8_t   PE;                           /**< 0001: KBI Pin Enables                                              */
   __IO uint8_t   ES;                           /**< 0002: KBI Edge Selects                                             */
} KBI_Type;

/**
 * @} */ /* End group KBI_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'KBI0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup KBI_Register_Masks_GROUP KBI Register Masks
* @brief Register Masks for KBI
* @{
*/
/* ------- SC Bit Fields                            ------ */
#define KBI0_SC_KBMOD_MASK                       (0x1U)                                              /*!< KBI0_SC.KBMOD Mask                      */
#define KBI0_SC_KBMOD_SHIFT                      (0U)                                                /*!< KBI0_SC.KBMOD Position                  */
#define KBI0_SC_KBMOD(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< KBI0_SC.KBMOD Field                     */
#define KBI0_SC_KBIE_MASK                        (0x2U)                                              /*!< KBI0_SC.KBIE Mask                       */
#define KBI0_SC_KBIE_SHIFT                       (1U)                                                /*!< KBI0_SC.KBIE Position                   */
#define KBI0_SC_KBIE(x)                          (((uint8_t)(((uint8_t)(x))<<1U))&0x2UL)             /*!< KBI0_SC.KBIE Field                      */
#define KBI0_SC_KBACK_MASK                       (0x4U)                                              /*!< KBI0_SC.KBACK Mask                      */
#define KBI0_SC_KBACK_SHIFT                      (2U)                                                /*!< KBI0_SC.KBACK Position                  */
#define KBI0_SC_KBACK(x)                         (((uint8_t)(((uint8_t)(x))<<2U))&0x4UL)             /*!< KBI0_SC.KBACK Field                     */
#define KBI0_SC_KBF_MASK                         (0x8U)                                              /*!< KBI0_SC.KBF Mask                        */
#define KBI0_SC_KBF_SHIFT                        (3U)                                                /*!< KBI0_SC.KBF Position                    */
#define KBI0_SC_KBF(x)                           (((uint8_t)(((uint8_t)(x))<<3U))&0x8UL)             /*!< KBI0_SC.KBF Field                       */
/* ------- PE Bit Fields                            ------ */
#define KBI0_PE_KBIPE_MASK                       (0x1U)                                              /*!< KBI0_PE.KBIPE Mask                      */
#define KBI0_PE_KBIPE_SHIFT                      (0U)                                                /*!< KBI0_PE.KBIPE Position                  */
#define KBI0_PE_KBIPE(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< KBI0_PE.KBIPE Field                     */
/* ------- ES Bit Fields                            ------ */
#define KBI0_ES_KBEDG_MASK                       (0x1U)                                              /*!< KBI0_ES.KBEDG Mask                      */
#define KBI0_ES_KBEDG_SHIFT                      (0U)                                                /*!< KBI0_ES.KBEDG Position                  */
#define KBI0_ES_KBEDG(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< KBI0_ES.KBEDG Field                     */
/**
 * @} */ /* End group KBI_Register_Masks_GROUP 
 */

