podonoghue/usbdm-firmware/BootLoopMKEx/Project_Headers/MKE02Z16M2.h
/* KBI0 - Peripheral instance base addresses */
#define KBI0_BasePtr                   0x40079000UL //!< Peripheral base address
#define KBI0                           ((KBI_Type *) KBI0_BasePtr) //!< Freescale base pointer
#define KBI0_BASE_PTR                  (KBI0) //!< Freescale style base pointer
/**
 * @} */ /* End group KBI_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup KBI_Peripheral_access_layer_GROUP KBI Peripheral Access Layer
* @brief C Struct for KBI
* @{
*/

/* ================================================================================ */
/* ================           KBI1 (derived from KBI0)             ================ */
/* ================================================================================ */

/**
 * @brief Keyboard interrupts
 */

/* KBI1 - Peripheral instance base addresses */
#define KBI1_BasePtr                   0x4007A000UL //!< Peripheral base address
#define KBI1                           ((KBI_Type *) KBI1_BasePtr) //!< Freescale base pointer
#define KBI1_BASE_PTR                  (KBI1) //!< Freescale style base pointer
/**
 * @} */ /* End group KBI_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup MCM_Peripheral_access_layer_GROUP MCM Peripheral Access Layer
* @brief C Struct for MCM
* @{
*/

/* ================================================================================ */
/* ================           MCM (file:MCM_MKE02Z2)               ================ */
/* ================================================================================ */

/**
 * @brief Core Platform Miscellaneous Control Module
 */
/**
* @addtogroup MCM_structs_GROUP MCM struct
* @brief Struct for MCM
* @{
*/
typedef struct {                                /*       MCM Structure                                                */
        uint8_t   RESERVED_0[8];               
   __I  uint16_t  PLASC;                        /**< 0008: Crossbar Switch (AXBS) Slave Configuration                   */
   __I  uint16_t  PLAMC;                        /**< 000A: Crossbar Switch (AXBS) Master Configuration                  */
   __IO uint32_t  PLACR;                        /**< 000C: Platform Control Register                                    */
} MCM_Type;

/**
 * @} */ /* End group MCM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'MCM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup MCM_Register_Masks_GROUP MCM Register Masks
* @brief Register Masks for MCM
* @{
*/
/* ------- PLASC Bit Fields                         ------ */
#define MCM_PLASC_ASC_MASK                       (0xFFU)                                             /*!< MCM_PLASC.ASC Mask                      */
#define MCM_PLASC_ASC_SHIFT                      (0U)                                                /*!< MCM_PLASC.ASC Position                  */
#define MCM_PLASC_ASC(x)                         (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< MCM_PLASC.ASC Field                     */
/* ------- PLAMC Bit Fields                         ------ */
#define MCM_PLAMC_AMC_MASK                       (0xFFU)                                             /*!< MCM_PLAMC.AMC Mask                      */
#define MCM_PLAMC_AMC_SHIFT                      (0U)                                                /*!< MCM_PLAMC.AMC Position                  */
#define MCM_PLAMC_AMC(x)                         (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< MCM_PLAMC.AMC Field                     */
/* ------- PLACR Bit Fields                         ------ */
#define MCM_PLACR_CFCC_MASK                      (0x400U)                                            /*!< MCM_PLACR.CFCC Mask                     */
#define MCM_PLACR_CFCC_SHIFT                     (10U)                                               /*!< MCM_PLACR.CFCC Position                 */
#define MCM_PLACR_CFCC(x)                        (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< MCM_PLACR.CFCC Field                    */
#define MCM_PLACR_DFCDA_MASK                     (0x800U)                                            /*!< MCM_PLACR.DFCDA Mask                    */
#define MCM_PLACR_DFCDA_SHIFT                    (11U)                                               /*!< MCM_PLACR.DFCDA Position                */
#define MCM_PLACR_DFCDA(x)                       (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< MCM_PLACR.DFCDA Field                   */
#define MCM_PLACR_DFCIC_MASK                     (0x1000U)                                           /*!< MCM_PLACR.DFCIC Mask                    */
#define MCM_PLACR_DFCIC_SHIFT                    (12U)                                               /*!< MCM_PLACR.DFCIC Position                */
#define MCM_PLACR_DFCIC(x)                       (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< MCM_PLACR.DFCIC Field                   */
#define MCM_PLACR_DFCC_MASK                      (0x2000U)                                           /*!< MCM_PLACR.DFCC Mask                     */
#define MCM_PLACR_DFCC_SHIFT                     (13U)                                               /*!< MCM_PLACR.DFCC Position                 */
#define MCM_PLACR_DFCC(x)                        (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< MCM_PLACR.DFCC Field                    */
#define MCM_PLACR_EFDS_MASK                      (0x4000U)                                           /*!< MCM_PLACR.EFDS Mask                     */
#define MCM_PLACR_EFDS_SHIFT                     (14U)                                               /*!< MCM_PLACR.EFDS Position                 */
#define MCM_PLACR_EFDS(x)                        (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< MCM_PLACR.EFDS Field                    */
#define MCM_PLACR_DFCS_MASK                      (0x8000U)                                           /*!< MCM_PLACR.DFCS Mask                     */
#define MCM_PLACR_DFCS_SHIFT                     (15U)                                               /*!< MCM_PLACR.DFCS Position                 */
#define MCM_PLACR_DFCS(x)                        (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< MCM_PLACR.DFCS Field                    */
#define MCM_PLACR_ESFC_MASK                      (0x10000U)                                          /*!< MCM_PLACR.ESFC Mask                     */
#define MCM_PLACR_ESFC_SHIFT                     (16U)                                               /*!< MCM_PLACR.ESFC Position                 */
#define MCM_PLACR_ESFC(x)                        (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< MCM_PLACR.ESFC Field                    */
/**
 * @} */ /* End group MCM_Register_Masks_GROUP 
 */

/* MCM - Peripheral instance base addresses */
#define MCM_BasePtr                    0xF0003000UL //!< Peripheral base address
#define MCM                            ((MCM_Type *) MCM_BasePtr) //!< Freescale base pointer
#define MCM_BASE_PTR                   (MCM) //!< Freescale style base pointer
/**
 * @} */ /* End group MCM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup NV_Peripheral_access_layer_GROUP NV Peripheral Access Layer
* @brief C Struct for NV
* @{
*/

/* ================================================================================ */
/* ================           NV (file:NV_FTMRH)                   ================ */
/* ================================================================================ */

/**
 * @brief Flash configuration field
 */
/**
* @addtogroup NV_structs_GROUP NV struct
* @brief Struct for NV
* @{
*/
typedef struct {                                /*       NV Structure                                                 */
   __I  uint8_t   BACKKEY[8];                   /**< 0000: Backdoor Comparison Key                                      */
        uint8_t   RESERVED_0[4];               
   __I  uint8_t   EEPROT;                       /**< 000C: Non-volatile E-Flash Protection Register (If implemented)    */
   __I  uint8_t   FPROT;                        /**< 000D: Non-volatile P-Flash Protection Register                     */
   __I  uint8_t   FSEC;                         /**< 000E: Non-volatile Flash Security Register                         */
   __I  uint8_t   FOPT;                         /**< 000F: Non-volatile Flash Option Register                           */
} NV_Type;

/**
 * @} */ /* End group NV_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'NV' Position & Mask macros                          ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup NV_Register_Masks_GROUP NV Register Masks
* @brief Register Masks for NV
* @{
*/
/* ------- BACKKEY Bit Fields                       ------ */
#define NV_BACKKEY_KEY_MASK                      (0xFFU)                                             /*!< NV_BACKKEY.KEY Mask                     */
#define NV_BACKKEY_KEY_SHIFT                     (0U)                                                /*!< NV_BACKKEY.KEY Position                 */
#define NV_BACKKEY_KEY(x)                        (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< NV_BACKKEY.KEY Field                    */
/* ------- EEPROT Bit Fields                        ------ */
#define NV_EEPROT_DPS_MASK                       (0x7U)                                              /*!< NV_EEPROT.DPS Mask                      */
#define NV_EEPROT_DPS_SHIFT                      (0U)                                                /*!< NV_EEPROT.DPS Position                  */
#define NV_EEPROT_DPS(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x7UL)             /*!< NV_EEPROT.DPS Field                     */
#define NV_EEPROT_DPOPEN_MASK                    (0x80U)                                             /*!< NV_EEPROT.DPOPEN Mask                   */
#define NV_EEPROT_DPOPEN_SHIFT                   (7U)                                                /*!< NV_EEPROT.DPOPEN Position               */
#define NV_EEPROT_DPOPEN(x)                      (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< NV_EEPROT.DPOPEN Field                  */
/* ------- FPROT Bit Fields                         ------ */
#define NV_FPROT_FPLS_MASK                       (0x3U)                                              /*!< NV_FPROT.FPLS Mask                      */
#define NV_FPROT_FPLS_SHIFT                      (0U)                                                /*!< NV_FPROT.FPLS Position                  */
#define NV_FPROT_FPLS(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x3UL)             /*!< NV_FPROT.FPLS Field                     */
#define NV_FPROT_FPLDIS_MASK                     (0x4U)                                              /*!< NV_FPROT.FPLDIS Mask                    */
#define NV_FPROT_FPLDIS_SHIFT                    (2U)                                                /*!< NV_FPROT.FPLDIS Position                */
#define NV_FPROT_FPLDIS(x)                       (((uint8_t)(((uint8_t)(x))<<2U))&0x4UL)             /*!< NV_FPROT.FPLDIS Field                   */
#define NV_FPROT_FPHS_MASK                       (0x18U)                                             /*!< NV_FPROT.FPHS Mask                      */
#define NV_FPROT_FPHS_SHIFT                      (3U)                                                /*!< NV_FPROT.FPHS Position                  */
#define NV_FPROT_FPHS(x)                         (((uint8_t)(((uint8_t)(x))<<3U))&0x18UL)            /*!< NV_FPROT.FPHS Field                     */
#define NV_FPROT_FPHDIS_MASK                     (0x20U)                                             /*!< NV_FPROT.FPHDIS Mask                    */
#define NV_FPROT_FPHDIS_SHIFT                    (5U)                                                /*!< NV_FPROT.FPHDIS Position                */
#define NV_FPROT_FPHDIS(x)                       (((uint8_t)(((uint8_t)(x))<<5U))&0x20UL)            /*!< NV_FPROT.FPHDIS Field                   */
#define NV_FPROT_FPOPEN_MASK                     (0x80U)                                             /*!< NV_FPROT.FPOPEN Mask                    */
#define NV_FPROT_FPOPEN_SHIFT                    (7U)                                                /*!< NV_FPROT.FPOPEN Position                */
#define NV_FPROT_FPOPEN(x)                       (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< NV_FPROT.FPOPEN Field                   */
/* ------- FSEC Bit Fields                          ------ */
#define NV_FSEC_SEC_MASK                         (0x3U)                                              /*!< NV_FSEC.SEC Mask                        */
#define NV_FSEC_SEC_SHIFT                        (0U)                                                /*!< NV_FSEC.SEC Position                    */
#define NV_FSEC_SEC(x)                           (((uint8_t)(((uint8_t)(x))<<0U))&0x3UL)             /*!< NV_FSEC.SEC Field                       */
#define NV_FSEC_FSLACC_MASK                      (0xCU)                                              /*!< NV_FSEC.FSLACC Mask                     */
#define NV_FSEC_FSLACC_SHIFT                     (2U)                                                /*!< NV_FSEC.FSLACC Position                 */
#define NV_FSEC_FSLACC(x)                        (((uint8_t)(((uint8_t)(x))<<2U))&0xCUL)             /*!< NV_FSEC.FSLACC Field                    */
#define NV_FSEC_MEEN_MASK                        (0x30U)                                             /*!< NV_FSEC.MEEN Mask                       */
#define NV_FSEC_MEEN_SHIFT                       (4U)                                                /*!< NV_FSEC.MEEN Position                   */
#define NV_FSEC_MEEN(x)                          (((uint8_t)(((uint8_t)(x))<<4U))&0x30UL)            /*!< NV_FSEC.MEEN Field                      */
#define NV_FSEC_KEYEN_MASK                       (0xC0U)                                             /*!< NV_FSEC.KEYEN Mask                      */
#define NV_FSEC_KEYEN_SHIFT                      (6U)                                                /*!< NV_FSEC.KEYEN Position                  */
#define NV_FSEC_KEYEN(x)                         (((uint8_t)(((uint8_t)(x))<<6U))&0xC0UL)            /*!< NV_FSEC.KEYEN Field                     */
/* ------- FOPT Bit Fields                          ------ */
/**
 * @} */ /* End group NV_Register_Masks_GROUP 
 */

