podonoghue/usbdm-firmware/BootLoopMKEx/Project_Headers/MKE02Z16M2.h
/* NV - Peripheral instance base addresses */
#define NV_BasePtr                     0x00000400UL //!< Peripheral base address
#define NV                             ((NV_Type *) NV_BasePtr) //!< Freescale base pointer
#define NV_BASE_PTR                    (NV) //!< Freescale style base pointer
/**
 * @} */ /* End group NV_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup OSC_Peripheral_access_layer_GROUP OSC Peripheral Access Layer
* @brief C Struct for OSC
* @{
*/

/* ================================================================================ */
/* ================           OSC (file:OSC_MKE)                   ================ */
/* ================================================================================ */

/**
 * @brief Oscillator
 */
/**
* @addtogroup OSC_structs_GROUP OSC struct
* @brief Struct for OSC
* @{
*/
typedef struct {                                /*       OSC Structure                                                */
   __IO uint8_t   CR;                           /**< 0000: Control Register                                             */
} OSC_Type;

/**
 * @} */ /* End group OSC_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'OSC' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup OSC_Register_Masks_GROUP OSC Register Masks
* @brief Register Masks for OSC
* @{
*/
/* ------- CR Bit Fields                            ------ */
#define OSC_CR_OSCINIT_MASK                      (0x1U)                                              /*!< OSC_CR.OSCINIT Mask                     */
#define OSC_CR_OSCINIT_SHIFT                     (0U)                                                /*!< OSC_CR.OSCINIT Position                 */
#define OSC_CR_OSCINIT(x)                        (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< OSC_CR.OSCINIT Field                    */
#define OSC_CR_HGO_MASK                          (0x2U)                                              /*!< OSC_CR.HGO Mask                         */
#define OSC_CR_HGO_SHIFT                         (1U)                                                /*!< OSC_CR.HGO Position                     */
#define OSC_CR_HGO(x)                            (((uint8_t)(((uint8_t)(x))<<1U))&0x2UL)             /*!< OSC_CR.HGO Field                        */
#define OSC_CR_RANGE_MASK                        (0x4U)                                              /*!< OSC_CR.RANGE Mask                       */
#define OSC_CR_RANGE_SHIFT                       (2U)                                                /*!< OSC_CR.RANGE Position                   */
#define OSC_CR_RANGE(x)                          (((uint8_t)(((uint8_t)(x))<<2U))&0x4UL)             /*!< OSC_CR.RANGE Field                      */
#define OSC_CR_OSCOS_MASK                        (0x10U)                                             /*!< OSC_CR.OSCOS Mask                       */
#define OSC_CR_OSCOS_SHIFT                       (4U)                                                /*!< OSC_CR.OSCOS Position                   */
#define OSC_CR_OSCOS(x)                          (((uint8_t)(((uint8_t)(x))<<4U))&0x10UL)            /*!< OSC_CR.OSCOS Field                      */
#define OSC_CR_OSCSTEN_MASK                      (0x20U)                                             /*!< OSC_CR.OSCSTEN Mask                     */
#define OSC_CR_OSCSTEN_SHIFT                     (5U)                                                /*!< OSC_CR.OSCSTEN Position                 */
#define OSC_CR_OSCSTEN(x)                        (((uint8_t)(((uint8_t)(x))<<5U))&0x20UL)            /*!< OSC_CR.OSCSTEN Field                    */
#define OSC_CR_OSCEN_MASK                        (0x80U)                                             /*!< OSC_CR.OSCEN Mask                       */
#define OSC_CR_OSCEN_SHIFT                       (7U)                                                /*!< OSC_CR.OSCEN Position                   */
#define OSC_CR_OSCEN(x)                          (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< OSC_CR.OSCEN Field                      */
/**
 * @} */ /* End group OSC_Register_Masks_GROUP 
 */

/* OSC - Peripheral instance base addresses */
#define OSC_BasePtr                    0x40065000UL //!< Peripheral base address
#define OSC                            ((OSC_Type *) OSC_BasePtr) //!< Freescale base pointer
#define OSC_BASE_PTR                   (OSC) //!< Freescale style base pointer
/**
 * @} */ /* End group OSC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup PIT_Peripheral_access_layer_GROUP PIT Peripheral Access Layer
* @brief C Struct for PIT
* @{
*/

/* ================================================================================ */
/* ================           PIT (file:PIT_2CH_CHAIN)             ================ */
/* ================================================================================ */

/**
 * @brief Periodic Interrupt Timer (2 channels)
 */
/**
* @addtogroup PIT_structs_GROUP PIT struct
* @brief Struct for PIT
* @{
*/
typedef struct {                                /*       PIT Structure                                                */
   __IO uint32_t  MCR;                          /**< 0000: Module Control Register                                      */
        uint8_t   RESERVED_0[252];             
   struct {
      __IO uint32_t  LDVAL;                     /**< 0100: Timer Load Value Register                                    */
      __I  uint32_t  CVAL;                      /**< 0104: Current Timer Value Register                                 */
      __IO uint32_t  TCTRL;                     /**< 0108: Timer Control Register                                       */
      __IO uint32_t  TFLG;                      /**< 010C: Timer Flag Register                                          */
   } CHANNEL[2];                                /**< 0100: (cluster: size=0x0020, 32)                                   */
} PIT_Type;

/**
 * @} */ /* End group PIT_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'PIT' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup PIT_Register_Masks_GROUP PIT Register Masks
* @brief Register Masks for PIT
* @{
*/
/* ------- MCR Bit Fields                           ------ */
#define PIT_MCR_FRZ_MASK                         (0x1U)                                              /*!< PIT_MCR.FRZ Mask                        */
#define PIT_MCR_FRZ_SHIFT                        (0U)                                                /*!< PIT_MCR.FRZ Position                    */
#define PIT_MCR_FRZ(x)                           (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< PIT_MCR.FRZ Field                       */
#define PIT_MCR_MDIS_MASK                        (0x2U)                                              /*!< PIT_MCR.MDIS Mask                       */
#define PIT_MCR_MDIS_SHIFT                       (1U)                                                /*!< PIT_MCR.MDIS Position                   */
#define PIT_MCR_MDIS(x)                          (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< PIT_MCR.MDIS Field                      */
/* ------- LDVAL Bit Fields                         ------ */
#define PIT_LDVAL_TSV_MASK                       (0xFFFFFFFFU)                                       /*!< PIT_LDVAL.TSV Mask                      */
#define PIT_LDVAL_TSV_SHIFT                      (0U)                                                /*!< PIT_LDVAL.TSV Position                  */
#define PIT_LDVAL_TSV(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< PIT_LDVAL.TSV Field                     */
/* ------- CVAL Bit Fields                          ------ */
#define PIT_CVAL_TVL_MASK                        (0xFFFFFFFFU)                                       /*!< PIT_CVAL.TVL Mask                       */
#define PIT_CVAL_TVL_SHIFT                       (0U)                                                /*!< PIT_CVAL.TVL Position                   */
#define PIT_CVAL_TVL(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< PIT_CVAL.TVL Field                      */
/* ------- TCTRL Bit Fields                         ------ */
#define PIT_TCTRL_TEN_MASK                       (0x1U)                                              /*!< PIT_TCTRL.TEN Mask                      */
#define PIT_TCTRL_TEN_SHIFT                      (0U)                                                /*!< PIT_TCTRL.TEN Position                  */
#define PIT_TCTRL_TEN(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< PIT_TCTRL.TEN Field                     */
#define PIT_TCTRL_TIE_MASK                       (0x2U)                                              /*!< PIT_TCTRL.TIE Mask                      */
#define PIT_TCTRL_TIE_SHIFT                      (1U)                                                /*!< PIT_TCTRL.TIE Position                  */
#define PIT_TCTRL_TIE(x)                         (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< PIT_TCTRL.TIE Field                     */
#define PIT_TCTRL_CHN_MASK                       (0x4U)                                              /*!< PIT_TCTRL.CHN Mask                      */
#define PIT_TCTRL_CHN_SHIFT                      (2U)                                                /*!< PIT_TCTRL.CHN Position                  */
#define PIT_TCTRL_CHN(x)                         (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< PIT_TCTRL.CHN Field                     */
/* ------- TFLG Bit Fields                          ------ */
#define PIT_TFLG_TIF_MASK                        (0x1U)                                              /*!< PIT_TFLG.TIF Mask                       */
#define PIT_TFLG_TIF_SHIFT                       (0U)                                                /*!< PIT_TFLG.TIF Position                   */
#define PIT_TFLG_TIF(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< PIT_TFLG.TIF Field                      */
/**
 * @} */ /* End group PIT_Register_Masks_GROUP 
 */

/* PIT - Peripheral instance base addresses */
#define PIT_BasePtr                    0x40037000UL //!< Peripheral base address
#define PIT                            ((PIT_Type *) PIT_BasePtr) //!< Freescale base pointer
#define PIT_BASE_PTR                   (PIT) //!< Freescale style base pointer
/**
 * @} */ /* End group PIT_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup PMC_Peripheral_access_layer_GROUP PMC Peripheral Access Layer
* @brief C Struct for PMC
* @{
*/

/* ================================================================================ */
/* ================           PMC (file:PMC_MKE)                   ================ */
/* ================================================================================ */

/**
 * @brief Power Management Controller
 */
/**
* @addtogroup PMC_structs_GROUP PMC struct
* @brief Struct for PMC
* @{
*/
typedef struct {                                /*       PMC Structure                                                */
   __IO uint8_t   SPMSC1;                       /**< 0000: System Power Management Status and Control 1 Register        */
   __IO uint8_t   SPMSC2;                       /**< 0001: System Power Management Status and Control 2 Register        */
} PMC_Type;

/**
 * @} */ /* End group PMC_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'PMC' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup PMC_Register_Masks_GROUP PMC Register Masks
* @brief Register Masks for PMC
* @{
*/
/* ------- SPMSC1 Bit Fields                        ------ */
#define PMC_SPMSC1_BGBE_MASK                     (0x1U)                                              /*!< PMC_SPMSC1.BGBE Mask                    */
#define PMC_SPMSC1_BGBE_SHIFT                    (0U)                                                /*!< PMC_SPMSC1.BGBE Position                */
#define PMC_SPMSC1_BGBE(x)                       (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< PMC_SPMSC1.BGBE Field                   */
#define PMC_SPMSC1_LVDE_MASK                     (0x4U)                                              /*!< PMC_SPMSC1.LVDE Mask                    */
#define PMC_SPMSC1_LVDE_SHIFT                    (2U)                                                /*!< PMC_SPMSC1.LVDE Position                */
#define PMC_SPMSC1_LVDE(x)                       (((uint8_t)(((uint8_t)(x))<<2U))&0x4UL)             /*!< PMC_SPMSC1.LVDE Field                   */
#define PMC_SPMSC1_LVDSE_MASK                    (0x8U)                                              /*!< PMC_SPMSC1.LVDSE Mask                   */
#define PMC_SPMSC1_LVDSE_SHIFT                   (3U)                                                /*!< PMC_SPMSC1.LVDSE Position               */
#define PMC_SPMSC1_LVDSE(x)                      (((uint8_t)(((uint8_t)(x))<<3U))&0x8UL)             /*!< PMC_SPMSC1.LVDSE Field                  */
#define PMC_SPMSC1_LVDRE_MASK                    (0x10U)                                             /*!< PMC_SPMSC1.LVDRE Mask                   */
#define PMC_SPMSC1_LVDRE_SHIFT                   (4U)                                                /*!< PMC_SPMSC1.LVDRE Position               */
#define PMC_SPMSC1_LVDRE(x)                      (((uint8_t)(((uint8_t)(x))<<4U))&0x10UL)            /*!< PMC_SPMSC1.LVDRE Field                  */
#define PMC_SPMSC1_LVWIE_MASK                    (0x20U)                                             /*!< PMC_SPMSC1.LVWIE Mask                   */
#define PMC_SPMSC1_LVWIE_SHIFT                   (5U)                                                /*!< PMC_SPMSC1.LVWIE Position               */
#define PMC_SPMSC1_LVWIE(x)                      (((uint8_t)(((uint8_t)(x))<<5U))&0x20UL)            /*!< PMC_SPMSC1.LVWIE Field                  */
#define PMC_SPMSC1_LVWACK_MASK                   (0x40U)                                             /*!< PMC_SPMSC1.LVWACK Mask                  */
#define PMC_SPMSC1_LVWACK_SHIFT                  (6U)                                                /*!< PMC_SPMSC1.LVWACK Position              */
#define PMC_SPMSC1_LVWACK(x)                     (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< PMC_SPMSC1.LVWACK Field                 */
#define PMC_SPMSC1_LVWF_MASK                     (0x80U)                                             /*!< PMC_SPMSC1.LVWF Mask                    */
#define PMC_SPMSC1_LVWF_SHIFT                    (7U)                                                /*!< PMC_SPMSC1.LVWF Position                */
#define PMC_SPMSC1_LVWF(x)                       (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< PMC_SPMSC1.LVWF Field                   */
/* ------- SPMSC2 Bit Fields                        ------ */
#define PMC_SPMSC2_LVWV_MASK                     (0x30U)                                             /*!< PMC_SPMSC2.LVWV Mask                    */
#define PMC_SPMSC2_LVWV_SHIFT                    (4U)                                                /*!< PMC_SPMSC2.LVWV Position                */
#define PMC_SPMSC2_LVWV(x)                       (((uint8_t)(((uint8_t)(x))<<4U))&0x30UL)            /*!< PMC_SPMSC2.LVWV Field                   */
#define PMC_SPMSC2_LVDV_MASK                     (0x40U)                                             /*!< PMC_SPMSC2.LVDV Mask                    */
#define PMC_SPMSC2_LVDV_SHIFT                    (6U)                                                /*!< PMC_SPMSC2.LVDV Position                */
#define PMC_SPMSC2_LVDV(x)                       (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< PMC_SPMSC2.LVDV Field                   */
/**
 * @} */ /* End group PMC_Register_Masks_GROUP 
 */

/* PMC - Peripheral instance base addresses */
#define PMC_BasePtr                    0x4007D000UL //!< Peripheral base address
#define PMC                            ((PMC_Type *) PMC_BasePtr) //!< Freescale base pointer
#define PMC_BASE_PTR                   (PMC) //!< Freescale style base pointer
/**
 * @} */ /* End group PMC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup PORT_Peripheral_access_layer_GROUP PORT Peripheral Access Layer
* @brief C Struct for PORT
* @{
*/

/* ================================================================================ */
/* ================           PORT (file:PORT_MKE02)               ================ */
/* ================================================================================ */

/**
 * @brief Port control
 */
/**
* @addtogroup PORT_structs_GROUP PORT struct
* @brief Struct for PORT
* @{
*/
typedef struct {                                /*       PORT Structure                                               */
   __IO uint32_t  IOFLT;                        /**< 0000: Port Filter Register                                         */
   __IO uint32_t  PUEL;                         /**< 0004: Port Pull-up Enable Low Register                             */
   __IO uint32_t  PUEH;                         /**< 0008: Port Pull-up Enable High Register                            */
   __IO uint32_t  HDRVE;                        /**< 000C: Port High Drive Enable Register                              */
} PORT_Type;

/**
 * @} */ /* End group PORT_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'PORT' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

