podonoghue/usbdm-firmware/BootLoopMKEx/Project_Headers/MKE02Z16M2.h
/**
* @addtogroup PORT_Register_Masks_GROUP PORT Register Masks
* @brief Register Masks for PORT
* @{
*/
/* ------- IOFLT Bit Fields                         ------ */
#define PORT_IOFLT_FLTA_MASK                     (0x3U)                                              /*!< PORT_IOFLT.FLTA Mask                    */
#define PORT_IOFLT_FLTA_SHIFT                    (0U)                                                /*!< PORT_IOFLT.FLTA Position                */
#define PORT_IOFLT_FLTA(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< PORT_IOFLT.FLTA Field                   */
#define PORT_IOFLT_FLTB_MASK                     (0xCU)                                              /*!< PORT_IOFLT.FLTB Mask                    */
#define PORT_IOFLT_FLTB_SHIFT                    (2U)                                                /*!< PORT_IOFLT.FLTB Position                */
#define PORT_IOFLT_FLTB(x)                       (((uint32_t)(((uint32_t)(x))<<2U))&0xCUL)           /*!< PORT_IOFLT.FLTB Field                   */
#define PORT_IOFLT_FLTC_MASK                     (0x30U)                                             /*!< PORT_IOFLT.FLTC Mask                    */
#define PORT_IOFLT_FLTC_SHIFT                    (4U)                                                /*!< PORT_IOFLT.FLTC Position                */
#define PORT_IOFLT_FLTC(x)                       (((uint32_t)(((uint32_t)(x))<<4U))&0x30UL)          /*!< PORT_IOFLT.FLTC Field                   */
#define PORT_IOFLT_FLTD_MASK                     (0xC0U)                                             /*!< PORT_IOFLT.FLTD Mask                    */
#define PORT_IOFLT_FLTD_SHIFT                    (6U)                                                /*!< PORT_IOFLT.FLTD Position                */
#define PORT_IOFLT_FLTD(x)                       (((uint32_t)(((uint32_t)(x))<<6U))&0xC0UL)          /*!< PORT_IOFLT.FLTD Field                   */
#define PORT_IOFLT_FLTE_MASK                     (0x300U)                                            /*!< PORT_IOFLT.FLTE Mask                    */
#define PORT_IOFLT_FLTE_SHIFT                    (8U)                                                /*!< PORT_IOFLT.FLTE Position                */
#define PORT_IOFLT_FLTE(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0x300UL)         /*!< PORT_IOFLT.FLTE Field                   */
#define PORT_IOFLT_FLTF_MASK                     (0xC00U)                                            /*!< PORT_IOFLT.FLTF Mask                    */
#define PORT_IOFLT_FLTF_SHIFT                    (10U)                                               /*!< PORT_IOFLT.FLTF Position                */
#define PORT_IOFLT_FLTF(x)                       (((uint32_t)(((uint32_t)(x))<<10U))&0xC00UL)        /*!< PORT_IOFLT.FLTF Field                   */
#define PORT_IOFLT_FLTG_MASK                     (0x3000U)                                           /*!< PORT_IOFLT.FLTG Mask                    */
#define PORT_IOFLT_FLTG_SHIFT                    (12U)                                               /*!< PORT_IOFLT.FLTG Position                */
#define PORT_IOFLT_FLTG(x)                       (((uint32_t)(((uint32_t)(x))<<12U))&0x3000UL)       /*!< PORT_IOFLT.FLTG Field                   */
#define PORT_IOFLT_FLTH_MASK                     (0xC000U)                                           /*!< PORT_IOFLT.FLTH Mask                    */
#define PORT_IOFLT_FLTH_SHIFT                    (14U)                                               /*!< PORT_IOFLT.FLTH Position                */
#define PORT_IOFLT_FLTH(x)                       (((uint32_t)(((uint32_t)(x))<<14U))&0xC000UL)       /*!< PORT_IOFLT.FLTH Field                   */
#define PORT_IOFLT_FLTRST_MASK                   (0x30000U)                                          /*!< PORT_IOFLT.FLTRST Mask                  */
#define PORT_IOFLT_FLTRST_SHIFT                  (16U)                                               /*!< PORT_IOFLT.FLTRST Position              */
#define PORT_IOFLT_FLTRST(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0x30000UL)      /*!< PORT_IOFLT.FLTRST Field                 */
#define PORT_IOFLT_FLTKBI0_MASK                  (0xC0000U)                                          /*!< PORT_IOFLT.FLTKBI0 Mask                 */
#define PORT_IOFLT_FLTKBI0_SHIFT                 (18U)                                               /*!< PORT_IOFLT.FLTKBI0 Position             */
#define PORT_IOFLT_FLTKBI0(x)                    (((uint32_t)(((uint32_t)(x))<<18U))&0xC0000UL)      /*!< PORT_IOFLT.FLTKBI0 Field                */
#define PORT_IOFLT_FLTKBI1_MASK                  (0x300000U)                                         /*!< PORT_IOFLT.FLTKBI1 Mask                 */
#define PORT_IOFLT_FLTKBI1_SHIFT                 (20U)                                               /*!< PORT_IOFLT.FLTKBI1 Position             */
#define PORT_IOFLT_FLTKBI1(x)                    (((uint32_t)(((uint32_t)(x))<<20U))&0x300000UL)     /*!< PORT_IOFLT.FLTKBI1 Field                */
#define PORT_IOFLT_FLTNMI_MASK                   (0xC00000U)                                         /*!< PORT_IOFLT.FLTNMI Mask                  */
#define PORT_IOFLT_FLTNMI_SHIFT                  (22U)                                               /*!< PORT_IOFLT.FLTNMI Position              */
#define PORT_IOFLT_FLTNMI(x)                     (((uint32_t)(((uint32_t)(x))<<22U))&0xC00000UL)     /*!< PORT_IOFLT.FLTNMI Field                 */
#define PORT_IOFLT_FLTDIV1_MASK                  (0x3000000U)                                        /*!< PORT_IOFLT.FLTDIV1 Mask                 */
#define PORT_IOFLT_FLTDIV1_SHIFT                 (24U)                                               /*!< PORT_IOFLT.FLTDIV1 Position             */
#define PORT_IOFLT_FLTDIV1(x)                    (((uint32_t)(((uint32_t)(x))<<24U))&0x3000000UL)    /*!< PORT_IOFLT.FLTDIV1 Field                */
#define PORT_IOFLT_FLTDIV2_MASK                  (0x1C000000U)                                       /*!< PORT_IOFLT.FLTDIV2 Mask                 */
#define PORT_IOFLT_FLTDIV2_SHIFT                 (26U)                                               /*!< PORT_IOFLT.FLTDIV2 Position             */
#define PORT_IOFLT_FLTDIV2(x)                    (((uint32_t)(((uint32_t)(x))<<26U))&0x1C000000UL)   /*!< PORT_IOFLT.FLTDIV2 Field                */
#define PORT_IOFLT_FLTDIV3_MASK                  (0xE0000000U)                                       /*!< PORT_IOFLT.FLTDIV3 Mask                 */
#define PORT_IOFLT_FLTDIV3_SHIFT                 (29U)                                               /*!< PORT_IOFLT.FLTDIV3 Position             */
#define PORT_IOFLT_FLTDIV3(x)                    (((uint32_t)(((uint32_t)(x))<<29U))&0xE0000000UL)   /*!< PORT_IOFLT.FLTDIV3 Field                */
/* ------- PUEL Bit Fields                          ------ */
#define PORT_PUEL_PTAPE_MASK                     (0xFFU)                                             /*!< PORT_PUEL.PTAPE Mask                    */
#define PORT_PUEL_PTAPE_SHIFT                    (0U)                                                /*!< PORT_PUEL.PTAPE Position                */
#define PORT_PUEL_PTAPE(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< PORT_PUEL.PTAPE Field                   */
#define PORT_PUEL_PTBPE_MASK                     (0xFF00U)                                           /*!< PORT_PUEL.PTBPE Mask                    */
#define PORT_PUEL_PTBPE_SHIFT                    (8U)                                                /*!< PORT_PUEL.PTBPE Position                */
#define PORT_PUEL_PTBPE(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< PORT_PUEL.PTBPE Field                   */
#define PORT_PUEL_PTCPE_MASK                     (0xFF0000U)                                         /*!< PORT_PUEL.PTCPE Mask                    */
#define PORT_PUEL_PTCPE_SHIFT                    (16U)                                               /*!< PORT_PUEL.PTCPE Position                */
#define PORT_PUEL_PTCPE(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< PORT_PUEL.PTCPE Field                   */
#define PORT_PUEL_PTDPE_MASK                     (0xFF000000U)                                       /*!< PORT_PUEL.PTDPE Mask                    */
#define PORT_PUEL_PTDPE_SHIFT                    (24U)                                               /*!< PORT_PUEL.PTDPE Position                */
#define PORT_PUEL_PTDPE(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0xFF000000UL)   /*!< PORT_PUEL.PTDPE Field                   */
/* ------- PUEH Bit Fields                          ------ */
#define PORT_PUEH_PTEPE_MASK                     (0xFFU)                                             /*!< PORT_PUEH.PTEPE Mask                    */
#define PORT_PUEH_PTEPE_SHIFT                    (0U)                                                /*!< PORT_PUEH.PTEPE Position                */
#define PORT_PUEH_PTEPE(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< PORT_PUEH.PTEPE Field                   */
#define PORT_PUEH_PTFPE_MASK                     (0xFF00U)                                           /*!< PORT_PUEH.PTFPE Mask                    */
#define PORT_PUEH_PTFPE_SHIFT                    (8U)                                                /*!< PORT_PUEH.PTFPE Position                */
#define PORT_PUEH_PTFPE(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< PORT_PUEH.PTFPE Field                   */
#define PORT_PUEH_PTGPE_MASK                     (0xFF0000U)                                         /*!< PORT_PUEH.PTGPE Mask                    */
#define PORT_PUEH_PTGPE_SHIFT                    (16U)                                               /*!< PORT_PUEH.PTGPE Position                */
#define PORT_PUEH_PTGPE(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< PORT_PUEH.PTGPE Field                   */
#define PORT_PUEH_PTHPE_MASK                     (0xFF000000U)                                       /*!< PORT_PUEH.PTHPE Mask                    */
#define PORT_PUEH_PTHPE_SHIFT                    (24U)                                               /*!< PORT_PUEH.PTHPE Position                */
#define PORT_PUEH_PTHPE(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0xFF000000UL)   /*!< PORT_PUEH.PTHPE Field                   */
/* ------- HDRVE Bit Fields                         ------ */
#define PORT_HDRVE_PTB4_MASK                     (0x1U)                                              /*!< PORT_HDRVE.PTB4 Mask                    */
#define PORT_HDRVE_PTB4_SHIFT                    (0U)                                                /*!< PORT_HDRVE.PTB4 Position                */
#define PORT_HDRVE_PTB4(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< PORT_HDRVE.PTB4 Field                   */
#define PORT_HDRVE_PTB5_MASK                     (0x2U)                                              /*!< PORT_HDRVE.PTB5 Mask                    */
#define PORT_HDRVE_PTB5_SHIFT                    (1U)                                                /*!< PORT_HDRVE.PTB5 Position                */
#define PORT_HDRVE_PTB5(x)                       (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< PORT_HDRVE.PTB5 Field                   */
#define PORT_HDRVE_PTD0_MASK                     (0x4U)                                              /*!< PORT_HDRVE.PTD0 Mask                    */
#define PORT_HDRVE_PTD0_SHIFT                    (2U)                                                /*!< PORT_HDRVE.PTD0 Position                */
#define PORT_HDRVE_PTD0(x)                       (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< PORT_HDRVE.PTD0 Field                   */
#define PORT_HDRVE_PTD1_MASK                     (0x8U)                                              /*!< PORT_HDRVE.PTD1 Mask                    */
#define PORT_HDRVE_PTD1_SHIFT                    (3U)                                                /*!< PORT_HDRVE.PTD1 Position                */
#define PORT_HDRVE_PTD1(x)                       (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< PORT_HDRVE.PTD1 Field                   */
#define PORT_HDRVE_PTE0_MASK                     (0x10U)                                             /*!< PORT_HDRVE.PTE0 Mask                    */
#define PORT_HDRVE_PTE0_SHIFT                    (4U)                                                /*!< PORT_HDRVE.PTE0 Position                */
#define PORT_HDRVE_PTE0(x)                       (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< PORT_HDRVE.PTE0 Field                   */
#define PORT_HDRVE_PTE1_MASK                     (0x20U)                                             /*!< PORT_HDRVE.PTE1 Mask                    */
#define PORT_HDRVE_PTE1_SHIFT                    (5U)                                                /*!< PORT_HDRVE.PTE1 Position                */
#define PORT_HDRVE_PTE1(x)                       (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< PORT_HDRVE.PTE1 Field                   */
#define PORT_HDRVE_PTH0_MASK                     (0x40U)                                             /*!< PORT_HDRVE.PTH0 Mask                    */
#define PORT_HDRVE_PTH0_SHIFT                    (6U)                                                /*!< PORT_HDRVE.PTH0 Position                */
#define PORT_HDRVE_PTH0(x)                       (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< PORT_HDRVE.PTH0 Field                   */
#define PORT_HDRVE_PTH1_MASK                     (0x80U)                                             /*!< PORT_HDRVE.PTH1 Mask                    */
#define PORT_HDRVE_PTH1_SHIFT                    (7U)                                                /*!< PORT_HDRVE.PTH1 Position                */
#define PORT_HDRVE_PTH1(x)                       (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< PORT_HDRVE.PTH1 Field                   */
/**
 * @} */ /* End group PORT_Register_Masks_GROUP 
 */

