podonoghue/usbdm-firmware/BootLoopMKEx/Project_Headers/MKE02Z16M2.h
/**
* @addtogroup SIM_Register_Masks_GROUP SIM Register Masks
* @brief Register Masks for SIM
* @{
*/
/* ------- SRSID Bit Fields                         ------ */
#define SIM_SRSID_LVD_MASK                       (0x2U)                                              /*!< SIM_SRSID.LVD Mask                      */
#define SIM_SRSID_LVD_SHIFT                      (1U)                                                /*!< SIM_SRSID.LVD Position                  */
#define SIM_SRSID_LVD(x)                         (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SIM_SRSID.LVD Field                     */
#define SIM_SRSID_LOC_MASK                       (0x4U)                                              /*!< SIM_SRSID.LOC Mask                      */
#define SIM_SRSID_LOC_SHIFT                      (2U)                                                /*!< SIM_SRSID.LOC Position                  */
#define SIM_SRSID_LOC(x)                         (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< SIM_SRSID.LOC Field                     */
#define SIM_SRSID_WDOG_MASK                      (0x20U)                                             /*!< SIM_SRSID.WDOG Mask                     */
#define SIM_SRSID_WDOG_SHIFT                     (5U)                                                /*!< SIM_SRSID.WDOG Position                 */
#define SIM_SRSID_WDOG(x)                        (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< SIM_SRSID.WDOG Field                    */
#define SIM_SRSID_PIN_MASK                       (0x40U)                                             /*!< SIM_SRSID.PIN Mask                      */
#define SIM_SRSID_PIN_SHIFT                      (6U)                                                /*!< SIM_SRSID.PIN Position                  */
#define SIM_SRSID_PIN(x)                         (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< SIM_SRSID.PIN Field                     */
#define SIM_SRSID_POR_MASK                       (0x80U)                                             /*!< SIM_SRSID.POR Mask                      */
#define SIM_SRSID_POR_SHIFT                      (7U)                                                /*!< SIM_SRSID.POR Position                  */
#define SIM_SRSID_POR(x)                         (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< SIM_SRSID.POR Field                     */
#define SIM_SRSID_LOCKUP_MASK                    (0x200U)                                            /*!< SIM_SRSID.LOCKUP Mask                   */
#define SIM_SRSID_LOCKUP_SHIFT                   (9U)                                                /*!< SIM_SRSID.LOCKUP Position               */
#define SIM_SRSID_LOCKUP(x)                      (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< SIM_SRSID.LOCKUP Field                  */
#define SIM_SRSID_SW_MASK                        (0x400U)                                            /*!< SIM_SRSID.SW Mask                       */
#define SIM_SRSID_SW_SHIFT                       (10U)                                               /*!< SIM_SRSID.SW Position                   */
#define SIM_SRSID_SW(x)                          (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< SIM_SRSID.SW Field                      */
#define SIM_SRSID_MDMAP_MASK                     (0x800U)                                            /*!< SIM_SRSID.MDMAP Mask                    */
#define SIM_SRSID_MDMAP_SHIFT                    (11U)                                               /*!< SIM_SRSID.MDMAP Position                */
#define SIM_SRSID_MDMAP(x)                       (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< SIM_SRSID.MDMAP Field                   */
#define SIM_SRSID_SACKERR_MASK                   (0x2000U)                                           /*!< SIM_SRSID.SACKERR Mask                  */
#define SIM_SRSID_SACKERR_SHIFT                  (13U)                                               /*!< SIM_SRSID.SACKERR Position              */
#define SIM_SRSID_SACKERR(x)                     (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< SIM_SRSID.SACKERR Field                 */
#define SIM_SRSID_PINID_MASK                     (0xF0000U)                                          /*!< SIM_SRSID.PINID Mask                    */
#define SIM_SRSID_PINID_SHIFT                    (16U)                                               /*!< SIM_SRSID.PINID Position                */
#define SIM_SRSID_PINID(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< SIM_SRSID.PINID Field                   */
#define SIM_SRSID_REVID_MASK                     (0xF00000U)                                         /*!< SIM_SRSID.REVID Mask                    */
#define SIM_SRSID_REVID_SHIFT                    (20U)                                               /*!< SIM_SRSID.REVID Position                */
#define SIM_SRSID_REVID(x)                       (((uint32_t)(((uint32_t)(x))<<20U))&0xF00000UL)     /*!< SIM_SRSID.REVID Field                   */
#define SIM_SRSID_SUBFAMID_MASK                  (0xF000000U)                                        /*!< SIM_SRSID.SUBFAMID Mask                 */
#define SIM_SRSID_SUBFAMID_SHIFT                 (24U)                                               /*!< SIM_SRSID.SUBFAMID Position             */
#define SIM_SRSID_SUBFAMID(x)                    (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< SIM_SRSID.SUBFAMID Field                */
#define SIM_SRSID_FAMID_MASK                     (0xF0000000U)                                       /*!< SIM_SRSID.FAMID Mask                    */
#define SIM_SRSID_FAMID_SHIFT                    (28U)                                               /*!< SIM_SRSID.FAMID Position                */
#define SIM_SRSID_FAMID(x)                       (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< SIM_SRSID.FAMID Field                   */
/* ------- SOPT Bit Fields                          ------ */
#define SIM_SOPT_NMIE_MASK                       (0x2U)                                              /*!< SIM_SOPT.NMIE Mask                      */
#define SIM_SOPT_NMIE_SHIFT                      (1U)                                                /*!< SIM_SOPT.NMIE Position                  */
#define SIM_SOPT_NMIE(x)                         (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SIM_SOPT.NMIE Field                     */
#define SIM_SOPT_RSTPE_MASK                      (0x4U)                                              /*!< SIM_SOPT.RSTPE Mask                     */
#define SIM_SOPT_RSTPE_SHIFT                     (2U)                                                /*!< SIM_SOPT.RSTPE Position                 */
#define SIM_SOPT_RSTPE(x)                        (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< SIM_SOPT.RSTPE Field                    */
#define SIM_SOPT_SWDE_MASK                       (0x8U)                                              /*!< SIM_SOPT.SWDE Mask                      */
#define SIM_SOPT_SWDE_SHIFT                      (3U)                                                /*!< SIM_SOPT.SWDE Position                  */
#define SIM_SOPT_SWDE(x)                         (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< SIM_SOPT.SWDE Field                     */
#define SIM_SOPT_ADHWT_MASK                      (0x300U)                                            /*!< SIM_SOPT.ADHWT Mask                     */
#define SIM_SOPT_ADHWT_SHIFT                     (8U)                                                /*!< SIM_SOPT.ADHWT Position                 */
#define SIM_SOPT_ADHWT(x)                        (((uint32_t)(((uint32_t)(x))<<8U))&0x300UL)         /*!< SIM_SOPT.ADHWT Field                    */
#define SIM_SOPT_RTCC_MASK                       (0x400U)                                            /*!< SIM_SOPT.RTCC Mask                      */
#define SIM_SOPT_RTCC_SHIFT                      (10U)                                               /*!< SIM_SOPT.RTCC Position                  */
#define SIM_SOPT_RTCC(x)                         (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< SIM_SOPT.RTCC Field                     */
#define SIM_SOPT_ACIC_MASK                       (0x800U)                                            /*!< SIM_SOPT.ACIC Mask                      */
#define SIM_SOPT_ACIC_SHIFT                      (11U)                                               /*!< SIM_SOPT.ACIC Position                  */
#define SIM_SOPT_ACIC(x)                         (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< SIM_SOPT.ACIC Field                     */
#define SIM_SOPT_RXDCE_MASK                      (0x1000U)                                           /*!< SIM_SOPT.RXDCE Mask                     */
#define SIM_SOPT_RXDCE_SHIFT                     (12U)                                               /*!< SIM_SOPT.RXDCE Position                 */
#define SIM_SOPT_RXDCE(x)                        (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< SIM_SOPT.RXDCE Field                    */
#define SIM_SOPT_RXDFE_MASK                      (0x2000U)                                           /*!< SIM_SOPT.RXDFE Mask                     */
#define SIM_SOPT_RXDFE_SHIFT                     (13U)                                               /*!< SIM_SOPT.RXDFE Position                 */
#define SIM_SOPT_RXDFE(x)                        (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< SIM_SOPT.RXDFE Field                    */
#define SIM_SOPT_FTMSYNC_MASK                    (0x4000U)                                           /*!< SIM_SOPT.FTMSYNC Mask                   */
#define SIM_SOPT_FTMSYNC_SHIFT                   (14U)                                               /*!< SIM_SOPT.FTMSYNC Position               */
#define SIM_SOPT_FTMSYNC(x)                      (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< SIM_SOPT.FTMSYNC Field                  */
#define SIM_SOPT_TXDME_MASK                      (0x8000U)                                           /*!< SIM_SOPT.TXDME Mask                     */
#define SIM_SOPT_TXDME_SHIFT                     (15U)                                               /*!< SIM_SOPT.TXDME Position                 */
#define SIM_SOPT_TXDME(x)                        (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< SIM_SOPT.TXDME Field                    */
#define SIM_SOPT_BUSREF_MASK                     (0x70000U)                                          /*!< SIM_SOPT.BUSREF Mask                    */
#define SIM_SOPT_BUSREF_SHIFT                    (16U)                                               /*!< SIM_SOPT.BUSREF Position                */
#define SIM_SOPT_BUSREF(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0x70000UL)      /*!< SIM_SOPT.BUSREF Field                   */
#define SIM_SOPT_CLKOE_MASK                      (0x80000U)                                          /*!< SIM_SOPT.CLKOE Mask                     */
#define SIM_SOPT_CLKOE_SHIFT                     (19U)                                               /*!< SIM_SOPT.CLKOE Position                 */
#define SIM_SOPT_CLKOE(x)                        (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< SIM_SOPT.CLKOE Field                    */
#define SIM_SOPT_DLYACT_MASK                     (0x800000U)                                         /*!< SIM_SOPT.DLYACT Mask                    */
#define SIM_SOPT_DLYACT_SHIFT                    (23U)                                               /*!< SIM_SOPT.DLYACT Position                */
#define SIM_SOPT_DLYACT(x)                       (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< SIM_SOPT.DLYACT Field                   */
#define SIM_SOPT_DELAY_MASK                      (0xFF000000U)                                       /*!< SIM_SOPT.DELAY Mask                     */
#define SIM_SOPT_DELAY_SHIFT                     (24U)                                               /*!< SIM_SOPT.DELAY Position                 */
#define SIM_SOPT_DELAY(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0xFF000000UL)   /*!< SIM_SOPT.DELAY Field                    */
/* ------- PINSEL Bit Fields                        ------ */
#define SIM_PINSEL_RTCPS_MASK                    (0x10U)                                             /*!< SIM_PINSEL.RTCPS Mask                   */
#define SIM_PINSEL_RTCPS_SHIFT                   (4U)                                                /*!< SIM_PINSEL.RTCPS Position               */
#define SIM_PINSEL_RTCPS(x)                      (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< SIM_PINSEL.RTCPS Field                  */
#define SIM_PINSEL_I2C0PS_MASK                   (0x20U)                                             /*!< SIM_PINSEL.I2C0PS Mask                  */
#define SIM_PINSEL_I2C0PS_SHIFT                  (5U)                                                /*!< SIM_PINSEL.I2C0PS Position              */
#define SIM_PINSEL_I2C0PS(x)                     (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< SIM_PINSEL.I2C0PS Field                 */
#define SIM_PINSEL_SPI0PS_MASK                   (0x40U)                                             /*!< SIM_PINSEL.SPI0PS Mask                  */
#define SIM_PINSEL_SPI0PS_SHIFT                  (6U)                                                /*!< SIM_PINSEL.SPI0PS Position              */
#define SIM_PINSEL_SPI0PS(x)                     (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< SIM_PINSEL.SPI0PS Field                 */
#define SIM_PINSEL_UART0PS_MASK                  (0x80U)                                             /*!< SIM_PINSEL.UART0PS Mask                 */
#define SIM_PINSEL_UART0PS_SHIFT                 (7U)                                                /*!< SIM_PINSEL.UART0PS Position             */
#define SIM_PINSEL_UART0PS(x)                    (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< SIM_PINSEL.UART0PS Field                */
#define SIM_PINSEL_FTM0PS0_MASK                  (0x100U)                                            /*!< SIM_PINSEL.FTM0PS0 Mask                 */
#define SIM_PINSEL_FTM0PS0_SHIFT                 (8U)                                                /*!< SIM_PINSEL.FTM0PS0 Position             */
#define SIM_PINSEL_FTM0PS0(x)                    (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< SIM_PINSEL.FTM0PS0 Field                */
#define SIM_PINSEL_FTM0PS1_MASK                  (0x200U)                                            /*!< SIM_PINSEL.FTM0PS1 Mask                 */
#define SIM_PINSEL_FTM0PS1_SHIFT                 (9U)                                                /*!< SIM_PINSEL.FTM0PS1 Position             */
#define SIM_PINSEL_FTM0PS1(x)                    (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< SIM_PINSEL.FTM0PS1 Field                */
#define SIM_PINSEL_FTM1PS0_MASK                  (0x400U)                                            /*!< SIM_PINSEL.FTM1PS0 Mask                 */
#define SIM_PINSEL_FTM1PS0_SHIFT                 (10U)                                               /*!< SIM_PINSEL.FTM1PS0 Position             */
#define SIM_PINSEL_FTM1PS0(x)                    (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< SIM_PINSEL.FTM1PS0 Field                */
#define SIM_PINSEL_FTM1PS1_MASK                  (0x800U)                                            /*!< SIM_PINSEL.FTM1PS1 Mask                 */
#define SIM_PINSEL_FTM1PS1_SHIFT                 (11U)                                               /*!< SIM_PINSEL.FTM1PS1 Position             */
#define SIM_PINSEL_FTM1PS1(x)                    (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< SIM_PINSEL.FTM1PS1 Field                */
#define SIM_PINSEL_FTM2PS0_MASK                  (0x1000U)                                           /*!< SIM_PINSEL.FTM2PS0 Mask                 */
#define SIM_PINSEL_FTM2PS0_SHIFT                 (12U)                                               /*!< SIM_PINSEL.FTM2PS0 Position             */
#define SIM_PINSEL_FTM2PS0(x)                    (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< SIM_PINSEL.FTM2PS0 Field                */
#define SIM_PINSEL_FTM2PS1_MASK                  (0x2000U)                                           /*!< SIM_PINSEL.FTM2PS1 Mask                 */
#define SIM_PINSEL_FTM2PS1_SHIFT                 (13U)                                               /*!< SIM_PINSEL.FTM2PS1 Position             */
#define SIM_PINSEL_FTM2PS1(x)                    (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< SIM_PINSEL.FTM2PS1 Field                */
#define SIM_PINSEL_FTM2PS2_MASK                  (0x4000U)                                           /*!< SIM_PINSEL.FTM2PS2 Mask                 */
#define SIM_PINSEL_FTM2PS2_SHIFT                 (14U)                                               /*!< SIM_PINSEL.FTM2PS2 Position             */
#define SIM_PINSEL_FTM2PS2(x)                    (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< SIM_PINSEL.FTM2PS2 Field                */
#define SIM_PINSEL_FTM2PS3_MASK                  (0x8000U)                                           /*!< SIM_PINSEL.FTM2PS3 Mask                 */
#define SIM_PINSEL_FTM2PS3_SHIFT                 (15U)                                               /*!< SIM_PINSEL.FTM2PS3 Position             */
#define SIM_PINSEL_FTM2PS3(x)                    (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< SIM_PINSEL.FTM2PS3 Field                */
/* ------- SCGC Bit Fields                          ------ */
#define SIM_SCGC_RTC_MASK                        (0x1U)                                              /*!< SIM_SCGC.RTC Mask                       */
#define SIM_SCGC_RTC_SHIFT                       (0U)                                                /*!< SIM_SCGC.RTC Position                   */
#define SIM_SCGC_RTC(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SIM_SCGC.RTC Field                      */
#define SIM_SCGC_PIT_MASK                        (0x2U)                                              /*!< SIM_SCGC.PIT Mask                       */
#define SIM_SCGC_PIT_SHIFT                       (1U)                                                /*!< SIM_SCGC.PIT Position                   */
#define SIM_SCGC_PIT(x)                          (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SIM_SCGC.PIT Field                      */
#define SIM_SCGC_FTM0_MASK                       (0x20U)                                             /*!< SIM_SCGC.FTM0 Mask                      */
#define SIM_SCGC_FTM0_SHIFT                      (5U)                                                /*!< SIM_SCGC.FTM0 Position                  */
#define SIM_SCGC_FTM0(x)                         (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< SIM_SCGC.FTM0 Field                     */
#define SIM_SCGC_FTM1_MASK                       (0x40U)                                             /*!< SIM_SCGC.FTM1 Mask                      */
#define SIM_SCGC_FTM1_SHIFT                      (6U)                                                /*!< SIM_SCGC.FTM1 Position                  */
#define SIM_SCGC_FTM1(x)                         (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< SIM_SCGC.FTM1 Field                     */
#define SIM_SCGC_FTM2_MASK                       (0x80U)                                             /*!< SIM_SCGC.FTM2 Mask                      */
#define SIM_SCGC_FTM2_SHIFT                      (7U)                                                /*!< SIM_SCGC.FTM2 Position                  */
#define SIM_SCGC_FTM2(x)                         (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< SIM_SCGC.FTM2 Field                     */
#define SIM_SCGC_CRC_MASK                        (0x400U)                                            /*!< SIM_SCGC.CRC Mask                       */
#define SIM_SCGC_CRC_SHIFT                       (10U)                                               /*!< SIM_SCGC.CRC Position                   */
#define SIM_SCGC_CRC(x)                          (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< SIM_SCGC.CRC Field                      */
#define SIM_SCGC_FLASH_MASK                      (0x1000U)                                           /*!< SIM_SCGC.FLASH Mask                     */
#define SIM_SCGC_FLASH_SHIFT                     (12U)                                               /*!< SIM_SCGC.FLASH Position                 */
#define SIM_SCGC_FLASH(x)                        (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< SIM_SCGC.FLASH Field                    */
#define SIM_SCGC_SWD_MASK                        (0x2000U)                                           /*!< SIM_SCGC.SWD Mask                       */
#define SIM_SCGC_SWD_SHIFT                       (13U)                                               /*!< SIM_SCGC.SWD Position                   */
#define SIM_SCGC_SWD(x)                          (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< SIM_SCGC.SWD Field                      */
#define SIM_SCGC_I2C_MASK                        (0x20000U)                                          /*!< SIM_SCGC.I2C Mask                       */
#define SIM_SCGC_I2C_SHIFT                       (17U)                                               /*!< SIM_SCGC.I2C Position                   */
#define SIM_SCGC_I2C(x)                          (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< SIM_SCGC.I2C Field                      */
#define SIM_SCGC_SPI0_MASK                       (0x40000U)                                          /*!< SIM_SCGC.SPI0 Mask                      */
#define SIM_SCGC_SPI0_SHIFT                      (18U)                                               /*!< SIM_SCGC.SPI0 Position                  */
#define SIM_SCGC_SPI0(x)                         (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< SIM_SCGC.SPI0 Field                     */
#define SIM_SCGC_SPI1_MASK                       (0x80000U)                                          /*!< SIM_SCGC.SPI1 Mask                      */
#define SIM_SCGC_SPI1_SHIFT                      (19U)                                               /*!< SIM_SCGC.SPI1 Position                  */
#define SIM_SCGC_SPI1(x)                         (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< SIM_SCGC.SPI1 Field                     */
#define SIM_SCGC_UART0_MASK                      (0x100000U)                                         /*!< SIM_SCGC.UART0 Mask                     */
#define SIM_SCGC_UART0_SHIFT                     (20U)                                               /*!< SIM_SCGC.UART0 Position                 */
#define SIM_SCGC_UART0(x)                        (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< SIM_SCGC.UART0 Field                    */
#define SIM_SCGC_UART1_MASK                      (0x200000U)                                         /*!< SIM_SCGC.UART1 Mask                     */
#define SIM_SCGC_UART1_SHIFT                     (21U)                                               /*!< SIM_SCGC.UART1 Position                 */
#define SIM_SCGC_UART1(x)                        (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< SIM_SCGC.UART1 Field                    */
#define SIM_SCGC_UART2_MASK                      (0x400000U)                                         /*!< SIM_SCGC.UART2 Mask                     */
#define SIM_SCGC_UART2_SHIFT                     (22U)                                               /*!< SIM_SCGC.UART2 Position                 */
