podonoghue/usbdm-firmware/BootLoopMKEx/Project_Headers/MKE02Z16M2.h
/* UART2 - Peripheral instance base addresses */
#define UART2_BasePtr                  0x4006C000UL //!< Peripheral base address
#define UART2                          ((UART_Type *) UART2_BasePtr) //!< Freescale base pointer
#define UART2_BASE_PTR                 (UART2) //!< Freescale style base pointer
/**
 * @} */ /* End group UART_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup WDOG_Peripheral_access_layer_GROUP WDOG Peripheral Access Layer
* @brief C Struct for WDOG
* @{
*/

/* ================================================================================ */
/* ================           WDOG (file:WDOG_MKE)                 ================ */
/* ================================================================================ */

/**
 * @brief Watchdog timer
 */
/**
* @addtogroup WDOG_structs_GROUP WDOG struct
* @brief Struct for WDOG
* @{
*/
typedef struct {                                /*       WDOG Structure                                               */
   __IO uint8_t   CS1;                          /**< 0000: Control and Status Register 1                                */
   __IO uint8_t   CS2;                          /**< 0001: Control and Status Register 2                                */
   union {                                      /**< 0000: (size=0002)                                                  */
      __IO uint16_t  CNT;                       /**< 0002: Counter Register: (Note: CNTL:CNTH)                          */
      struct {                                  /**< 0000: (size=0002)                                                  */
         __I  uint8_t   CNTH;                   /**< 0002: Counter Register: High (see CNT for description)             */
         __I  uint8_t   CNTL;                   /**< 0003: Counter Register: Low (see CNT for description)              */
      };
   };
   union {                                      /**< 0000: (size=0002)                                                  */
      __IO uint16_t  TOVAL;                     /**< 0004: Timeout Value Register: (Note TOVALL:TOVALH)                 */
      struct {                                  /**< 0000: (size=0002)                                                  */
         __IO uint8_t   TOVALH;                 /**< 0004: Timeout Value Register: High (see TOVAL for description)     */
         __IO uint8_t   TOVALL;                 /**< 0005: Timeout Value Register: Low (see TOVAL for description)      */
      };
   };
   union {                                      /**< 0000: (size=0002)                                                  */
      __IO uint16_t  WIN;                       /**< 0006: Window Register:(Note WINL:WINH)                             */
      struct {                                  /**< 0000: (size=0002)                                                  */
         __IO uint8_t   WINH;                   /**< 0006: Window Register: High (see WIN for description)              */
         __IO uint8_t   WINL;                   /**< 0007: Window Register: Low (see WIN for description)               */
      };
   };
} WDOG_Type;

/**
 * @} */ /* End group WDOG_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'WDOG' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup WDOG_Register_Masks_GROUP WDOG Register Masks
* @brief Register Masks for WDOG
* @{
*/
/* ------- CS1 Bit Fields                           ------ */
#define WDOG_CS1_STOP_MASK                       (0x1U)                                              /*!< WDOG_CS1.STOP Mask                      */
#define WDOG_CS1_STOP_SHIFT                      (0U)                                                /*!< WDOG_CS1.STOP Position                  */
#define WDOG_CS1_STOP(x)                         (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< WDOG_CS1.STOP Field                     */
#define WDOG_CS1_WAIT_MASK                       (0x2U)                                              /*!< WDOG_CS1.WAIT Mask                      */
#define WDOG_CS1_WAIT_SHIFT                      (1U)                                                /*!< WDOG_CS1.WAIT Position                  */
#define WDOG_CS1_WAIT(x)                         (((uint8_t)(((uint8_t)(x))<<1U))&0x2UL)             /*!< WDOG_CS1.WAIT Field                     */
#define WDOG_CS1_DBG_MASK                        (0x4U)                                              /*!< WDOG_CS1.DBG Mask                       */
#define WDOG_CS1_DBG_SHIFT                       (2U)                                                /*!< WDOG_CS1.DBG Position                   */
#define WDOG_CS1_DBG(x)                          (((uint8_t)(((uint8_t)(x))<<2U))&0x4UL)             /*!< WDOG_CS1.DBG Field                      */
#define WDOG_CS1_TST_MASK                        (0x18U)                                             /*!< WDOG_CS1.TST Mask                       */
#define WDOG_CS1_TST_SHIFT                       (3U)                                                /*!< WDOG_CS1.TST Position                   */
#define WDOG_CS1_TST(x)                          (((uint8_t)(((uint8_t)(x))<<3U))&0x18UL)            /*!< WDOG_CS1.TST Field                      */
#define WDOG_CS1_UPDATE_MASK                     (0x20U)                                             /*!< WDOG_CS1.UPDATE Mask                    */
#define WDOG_CS1_UPDATE_SHIFT                    (5U)                                                /*!< WDOG_CS1.UPDATE Position                */
#define WDOG_CS1_UPDATE(x)                       (((uint8_t)(((uint8_t)(x))<<5U))&0x20UL)            /*!< WDOG_CS1.UPDATE Field                   */
#define WDOG_CS1_INT_MASK                        (0x40U)                                             /*!< WDOG_CS1.INT Mask                       */
#define WDOG_CS1_INT_SHIFT                       (6U)                                                /*!< WDOG_CS1.INT Position                   */
#define WDOG_CS1_INT(x)                          (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< WDOG_CS1.INT Field                      */
#define WDOG_CS1_EN_MASK                         (0x80U)                                             /*!< WDOG_CS1.EN Mask                        */
#define WDOG_CS1_EN_SHIFT                        (7U)                                                /*!< WDOG_CS1.EN Position                    */
#define WDOG_CS1_EN(x)                           (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< WDOG_CS1.EN Field                       */
/* ------- CS2 Bit Fields                           ------ */
#define WDOG_CS2_CLK_MASK                        (0x3U)                                              /*!< WDOG_CS2.CLK Mask                       */
#define WDOG_CS2_CLK_SHIFT                       (0U)                                                /*!< WDOG_CS2.CLK Position                   */
#define WDOG_CS2_CLK(x)                          (((uint8_t)(((uint8_t)(x))<<0U))&0x3UL)             /*!< WDOG_CS2.CLK Field                      */
#define WDOG_CS2_PRES_MASK                       (0x10U)                                             /*!< WDOG_CS2.PRES Mask                      */
#define WDOG_CS2_PRES_SHIFT                      (4U)                                                /*!< WDOG_CS2.PRES Position                  */
#define WDOG_CS2_PRES(x)                         (((uint8_t)(((uint8_t)(x))<<4U))&0x10UL)            /*!< WDOG_CS2.PRES Field                     */
#define WDOG_CS2_FLG_MASK                        (0x40U)                                             /*!< WDOG_CS2.FLG Mask                       */
#define WDOG_CS2_FLG_SHIFT                       (6U)                                                /*!< WDOG_CS2.FLG Position                   */
#define WDOG_CS2_FLG(x)                          (((uint8_t)(((uint8_t)(x))<<6U))&0x40UL)            /*!< WDOG_CS2.FLG Field                      */
#define WDOG_CS2_WIN_MASK                        (0x80U)                                             /*!< WDOG_CS2.WIN Mask                       */
#define WDOG_CS2_WIN_SHIFT                       (7U)                                                /*!< WDOG_CS2.WIN Position                   */
#define WDOG_CS2_WIN(x)                          (((uint8_t)(((uint8_t)(x))<<7U))&0x80UL)            /*!< WDOG_CS2.WIN Field                      */
/* ------- CNT Bit Fields                           ------ */
/* ------- CNTH Bit Fields                          ------ */
/* ------- CNTL Bit Fields                          ------ */
/* ------- TOVAL Bit Fields                         ------ */
/* ------- TOVALH Bit Fields                        ------ */
/* ------- TOVALL Bit Fields                        ------ */
/* ------- WIN Bit Fields                           ------ */
/* ------- WINH Bit Fields                          ------ */
/* ------- WINL Bit Fields                          ------ */
/**
 * @} */ /* End group WDOG_Register_Masks_GROUP 
 */

/* WDOG - Peripheral instance base addresses */
#define WDOG_BasePtr                   0x40052000UL //!< Peripheral base address
#define WDOG                           ((WDOG_Type *) WDOG_BasePtr) //!< Freescale base pointer
#define WDOG_BASE_PTR                  (WDOG) //!< Freescale style base pointer
/**
 * @} */ /* End group WDOG_Peripheral_access_layer_GROUP 
 */
/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif
/**
 * @} */ /* End group Peripheral_access_layer_GROUP 
 */

#ifdef __cplusplus
}
#endif


#endif  /* MCU_MKE02Z2 */

